[{"comment":"Traveling from the US, you can stay in many European countries for 90 days prior to needing a visa. I don’t know anything about specifically getting a French visa, but I have done my entire visa process since arriving in Germany from the US. [Due to timing with my university acceptance, I could not do any of the visa process before coming here.] \n\nI don’t know your specific situation, but this is a possibility. I came very prepared with all possible documents that I thought I could need, and made my visa appointment immediately. The next available appointment when I arrived was about two months out, but that was fine because it gave me time make a bank account, get health insurance, etc. "},{"comment":"It's a Schengen visa right?\n\nSorry to say, you might be screwed. For Spain in CA, you basically had one shot and needed to schedule it months in advance, only 2 embassies. Otherwise, it's checking online and calling 2-4x\/day for a cancelled appointment.\n\nIt doesn't seem like mid-December would be enough time to get it back anyway, I think mine took 3 weeks. "},{"comment":"UPDATE: turns out I was able to schedule an appointment in Atlanta, but I've got one in NYC after all!!"},{"comment":"Where was he born? Some documents are issued in Canada by default in English and French. That would save a bit of translating. \n\nEdit to add: To more fully answer the question, there isn't really a better passport since neither is in the EU. After finishing a masters, he can get a 12-month extension to look for a job ([source](http:\/\/www.campusfrance.org\/fr\/page\/travailler-en-france-apres-ses-études)).\n\nIs he already in France on a work-visa? If he's already here then he should probably be speaking with the university's international student office, or the local government."},{"comment":"How close does your friend live to a French consulate in the US? I'm not sure if it's changed since 2013 but I had to apply *in person* for my student visa and wait for my \"Campus France\" application to process before I could make my consulate appointment which took *forever*. I had to go to San Francisco for my appointment so I turned it into a vacation but aside from that it wasn't a huge deal. FWIW, dress well for your consulate appointment; the photo they took at the consulate is the one they ended up putting on my visa. I also had to pay a reciprocity fee (around $100), not sure what it costs for Canadians. \n\nedit: reread your post after writing this. Is he currently living in France? Not sure what would be required if he's already over there tbh. \n\n> he wants a visa that will allow him to look for a job at the end of his degree\n\nAside from au pairing and student jobs, student visas are *not* employment visas. His visa will likely terminate exactly as his masters is ending. At that point, he can exit the Schengen zone and return once his student visa expires (now on his 90 day Schengen visa) to look for a job. As a US\/Canadian, he has the 90 day visa-free window anyway. "},{"comment":"Sounds like a really nice friend! Definitely a motivational text OP! Thanks!"},{"comment":"You don't know how much this post just helps me stay positive despite my current situation here in the US. It's tough but I'm carrying on. "},{"comment":"\"A wizard is never late, nor is he early; he arrives precisely when he means to.\"\n\n Words to live by!"},{"comment":"Wow totally needed this! Just got out of the Marines and I start school tomorrow for the first time in 3 or so years. All my friends graduate within the year and\/or next year. I'm a little behind them but hey, I'm in my own 'time zone' so I'm not worried. Thank you for posting this :)"},{"comment":"[deleted]"},{"comment":"Really needed this rn OP. Really been feeling like everyone's leaving me in the dust lately."},{"comment":"Your friend is wise. You want to hold on to friends like that your whole life."},{"comment":"Needed this right now! Thank you"},{"comment":"This just changed my view on things. I'm always worried about falling behind others."},{"comment":"Hits home. Thanks OP."},{"comment":"Of all things that I've seen posted in this subreddit, this is the most satisfying thing to read. After graduating earlier this year, moving back home with my family, being the most skint I have ever been in 3 years and generally feeling pretty damn depressed. \n\nThis made me pause for a second a think that'll be alright eventually."},{"comment":"It's  been hard to stay focused and positive lately, what a good message. "},{"comment":"Damn I needed this as well. Sounds like you have a great friend!"},{"comment":"This was one of my biggest fears every time I left the country when I was on the student visa. Every time I left I knew there was no guarantee I could return. Every time I tried to renew I knew there was no guarantee that I could. It motivated me to do the best I can. \nNow that I have the citizenship I have lazed down considerably. "},{"comment":"Hey man. I start college tomorrow at 26 years old. I am excited and scared, but those 18 yr Olds don't scare me. They don't know nothin. "},{"comment":"Beautiful words :)"},{"comment":"A very good and caring friend. Hang in there :)"},{"comment":"Could use this kind of text every now and then. "},{"comment":"Totally needed to read this. I feel like my life has been frozen in time for the last year because of visa issues. Imagine graduating with honors and internships under your belt only to be denied the possibility of getting hired."},{"comment":"I was supposed to start my masters in the UK in 3 weeks but I have no funding for it so I was devastated that I will have to defer my registration to next year. This post put me back in my time zone and I will be working hard to make sure things work out the next year. \n\nThanks."},{"comment":"I love that this entire thread has a very positive and supportive vibe. Makes a down boater like me proud to be upvoting and helping out!"},{"comment":"Buried but I need this, I went back to school to receive my bachelor's and against my parents' wishes or any support from my family, this motivates to continue and finish. I'm 25 and by the time I'll finish I will be 28."},{"comment":"Makes me feel very grateful to be born in the U.S"},{"comment":"This is some Gandalf type shit. A wizard is always on time. "},{"comment":"As a 50-year old in the process of finishing a Bachelor's degree, I approve of this message!\n\nYou have a good friend. I hope you and your friend both go far in life and remain friends forever.\n\n"},{"comment":"Needed to read this today so thank you very much "},{"comment":"Your friend is awesome "},{"comment":"Incredibly wise and insightful"},{"comment":"I totally read thus in Dave Lister's voice.  Might have something to do with me watching the series from beginning to current again."},{"comment":"That's a great quote. I hope you don't mind but I'm going to steal it and print it off!\n\nAbout the VISA, whatever your next steps happen to be best of luck."},{"comment":"That was really nice of your friend. Mind if I ask why your application was rejected?"},{"comment":"Wow your friend is a wise person. Thanks for the post it really helped me in my situation."},{"comment":"This is dope"},{"comment":"You've got a good friend there.  If you have the means, it might be good paying for a consult with an immigration lawyer. There may be an angle you haven't thought of. "},{"comment":"my best friend only sends me dick pics"},{"comment":"\"Time Zone\". What a wonderful way of putting it. You have a wonderful friend. "},{"comment":"Comparison is the thief of joy. "},{"comment":"It is fate to win or lose, that can be nudged in your favor by passing on good karma,to those in need. And being humble enough to not seek recognition for it."},{"comment":"That is intensely insightful. I'm glad you posted. Thank you."},{"comment":"That's awesome! I am going to share this to some other groups I am a part of!"},{"comment":"As a guy that just finished his bachelor's and turned 30 this month, this is a hell of a pick me up. Thank you for sharing. :)"},{"comment":"This is awesome! Thanks for sharing! I found it quite refreshing as a new perspective on things. Never heard it worded that way before."},{"comment":"Beautiful. No pretentiousness, no fancy words, just pure wonderful feel-good advice. Although I often can't resist the urge to be pessimistic and dismiss every kind word, this time I'll keep my mouth shut.\n\nStay in touch with that friend"},{"comment":"Woah. That made me feel much better. I've become anxious lately because Im making big changes with myself. Or atleast trying.. my best friend told me not to get caught up in changing but to just DO it. Reading this helped even more. Thanks for sharing!!"},{"comment":"Thank you for this as I'm going through kinnda the same thing"},{"comment":"Honestly, what an amazing friend! That's such a thoughtful reply. Wonderful. And good luck to you. "},{"comment":"As a 28 year old getting a degree after this year.. I needed this."},{"comment":"i love your friend. i needed to hear this."},{"comment":"[deleted]"},{"comment":"Been having a lot of questions on how good im doing at age 23, 24 in a couple months. Definately helped  resolve my issues. Glad I read this. Thanks for the post!"},{"comment":">Sometimes you're ahead, sometimes you're behind. The race is long; and in the end it's only with yourself"},{"comment":"Reading this really made me feel better about where my life is. People younger than me have made it farther along in less time, but they didn't have the same set of issues to overcome.\n\n\n\nEveryone's working within their Time Zone...\n\n\n\nI like it."},{"comment":"Im 21 from Central Europe and this really keeps me positive when I read this.\nThe thing is im too behind everybody from most of my friends.\nI still didnt get a drivers license (currently working on it) I chose to complete a school that didnt suite me at all, so I just flipped around and im currently in a Apprenticeship as IT Technician wich is almost over !\nOriginally I just wanted to work as a Office Worker (hence doing the school wich i realised wasnt for me after all) \n\nMost of the Younger People just decide their Apprenticeship or School and go on with it and are done with 18 or 19 so they get good Money, depending on the Job though.\n\nBut thanks for the Text, I just made a Account for that and im lurking reddit for years now ! :) "},{"comment":"I needed this message for a long time.. I need to focus on my timezone "},{"comment":"Exactly what I needed to read. Thank you op for posting this!"},{"comment":"To every thing  \n*turn, turn, turn,*   \nthere is a season  \n*turn, turn, turn,*   \nand a time for every purpose under Heaven.  [Ecclesiastes 3:1](https:\/\/www.youtube.com\/watch?v=W4ga_M5Zdn4)\n\n"},{"comment":">graduated at 27 and secured employment immediately! \n  \nThats me.   \nI thought I was really behind .. I feel so blessed."},{"comment":"Thank you for sharing ♡"},{"comment":"This is incredible.  As someone who is looking down the barrel of two years of premed and four years of Med school, this really helps.\n\nThank you and please thank your friend, since he has helped some random stranger on the Internet that really needed to hear what he had to say."},{"comment":"I'm just here to vent the stupid US student\/working visa processing and program. I honestly can't believe they rejected your renewal. If you want to talk just PM me."},{"comment":"[removed]"},{"comment":"As someone who's caving under the pressure of being very far from my goals, not seeing a clear route how to get there, and feeling the pressure of being 30 and not in my intended direction, this helped to mildly assuage the pressure."},{"comment":"As someone who just transferred to a university and still has 5 years of school left at the age of 27 this really makes me feel good.\n\nThanks for sharing."},{"comment":"Join the army reserves or national guard. Get US citizenship and money for school. Only takes 4-5 months of training :)"},{"comment":"The only time this does not apply sadly is to a woman who wants kids."},{"comment":"noobest shit I've ever read"},{"comment":"\nSounds like a bunch of bulls**t"},{"comment":"Wow"},{"comment":"As someone who always felt older than the kids around him, but besides always being tall, physically matured slower, I definitely get working on your own timeline. Thank you for sharing this, your friend seems like a smart caring person. "},{"comment":"This is a great reminder to stop comparing my \"success\" to my friends \/ family. My time will come."},{"comment":"this is golden! good on your friend."},{"comment":"This is pretty good"},{"comment":"You're a wizard, gandalf. "},{"comment":"I needed that. Thank you."},{"comment":"Great message! :)"},{"comment":"This is spot on"},{"comment":"Thank you for sharing my friend"},{"comment":"Well MY timezone doesnt comfort me at all. I'm still late for alot of things even in my timezone. I'm doomed."},{"comment":"Kk, I really needed this. "},{"comment":"This is so cool. I love this perspective. Thanks, and good luck to you!"},{"comment":"Agree completely"},{"comment":"This is what I needed now, thanks."},{"comment":"Of all the posts I've seen in this sub, this one really struck home. "},{"comment":"Smart Friend"},{"comment":"Nice message. You can only judge yourself against your own scale, which hopefully does not include a banana. "},{"comment":"I'm stressed out about applying to college, and seeing all my friends applying to #1 ranked schools and I would just be happy to go to a school they look at as a safety.\n\nThanks for this op"},{"comment":"Thanks so much man. That really made me smile.\n\nI'm in a situation atm where I really have no direction and have just been floating around since graduation 2 years ago. "},{"comment":"Totally true, and I try to remind myself of this as much as possible.\n\nBut still, some time zones may not look too good on a resume."},{"comment":"As someone who seems to always hit a major obstacle every semester, this resonates a lot with me. I was very close to dropping another semester due to medical reasons. I've been in college for 6 years and while it may not seem like a lot, I'm constantly reminded of others whom have already gotten their masters whereas I haven't even completed a bachelors.\n\nThank you."},{"comment":"You have a really good friend who has a really good head on their shoulders."},{"comment":"Wish I had a friend like yours :) "},{"comment":"I love this. I've never heard this analogy made before.\n\nI'd say that a lot of my sadness in life comes from comparing my self to others. I always thought I'd be getting hunnies at a young age, didn't lose my virginity until I was 20 years old. Thought I'd graduate college early, now I'm 23 and all flunked out just trying to stay afloat in life.\n\nBut looking back now... Hey, so many of those people who seems miles ahead of me are now far behind me. Those who seem way ahead of me now may even fall behind at some point.\n\nComparing yourself to others is meaningless."},{"comment":"This is an awesome piece. Honestly. It really is. It doesn't matter if you finished school slower, started your own company later, or got your real adult job at 22 or 28. It's your life and you are different than everyone else. Be happy with what you are and where you are and enjoy the journey."},{"comment":"That was truly inspiring. I've seen and been envious of people getting ahead. Taking a step back and staying in my lane has and can still be a struggle. "},{"comment":"This made me cry. Thank you."},{"comment":"Needed this, thanks OP"},{"comment":"I really needed this. Give your friend a hug from me."},{"comment":"Damn, after reading this.... \"Let me tackle a brick wall\""},{"comment":"Made me consider things. Cheers, dude."},{"comment":"OP why did your visa get rejected...did you contact a lawyer?"},{"comment":"I have never commented on theses motivation posts.. but this.. this touched me. Thank you it has helped this moment of my day and I appreciate that."},{"comment":"This is absolutely what I needed.. Thank you for sharing! I am going through my own woes of my life.. Thank you again."},{"comment":"A lovely message!\nThanks for sharing and hope you and your friend have a good day:) :3"},{"comment":"This is great! So needed to hear this right now."},{"comment":"I really needed this. "},{"comment":"\"Stay true to yourself\"\n\nI have anxiety. I've had it all my life. So is this anxiety\/shyness part of who I am. Or my want or need to be outgoing who I am? How do I stay true to myself?"},{"comment":"This is literally exactly what I needed to hear right now! Thank you OP!"},{"comment":"That sounds great and all, unless you obtain your goal\/dream at an age where you don't get to really enjoy it..."},{"comment":"I needed this today. I've been so focus on my shitty retail job and feel down about not focusing on my hobbies and the things that make me happy.  \n\nYour friend is a good friend."},{"comment":"You got to buy a round of drinks for your friend :)"},{"comment":"[deleted]"},{"comment":"SAVED this! Thanks so much. Your friend is amazing!"},{"comment":"That's a good friend. I'm sure you are a lucky man. "},{"comment":"This was exactly what I needed to see today. After getting my ass chewed for working over to try and meet a deadline and care for those under my care. Fuck you boss"},{"comment":"The text should have said \"find a way to get to Mexico, then sneak through the southern border of the us and you'll be treated like an in state member at the university of your choice with likely a ton of federal aid\""},{"comment":"That person is wise beyond their years no matter how old they are. "},{"comment":"Wait so they can basically fuck you over by not renewing your visa whenever they want? Even if it's 2nd-3rd+ year of uni? How is that even allowed?"},{"comment":"As Dan Gheesling once said \"Kenya will rise!\""},{"comment":"Student debt is life long slavery in most cases. Go start a business. "},{"comment":"Thank you. Needed this today. "},{"comment":"[There is a season...] (https:\/\/www.youtube.com\/watch?v=fHvf20Y6eoM)"},{"comment":"Thank you. "},{"comment":"Wow this is very Zen like. "},{"comment":"Reading this on a 5 year old laptop in my mom's basement ..at age 29. "},{"comment":"I kinda needed to read this as someone who wants to finish my Comp Sci degree then go and get a bachelors in Bio and go to dental school. I always stress out about the fact that I won't graduate dental until at least 31 "},{"comment":"One inportant thing that I learnt not long ago, Motivation is good and all, but it is only truthfully good when u start taking course of \"change\" , it is Self Discipline that actually gets you going. \nhope u got what i meant, im not the best at explaining stuff.."},{"comment":"Some of my friends, who do just exactly right with respect to timings, I call them, professional life livers. They do what exactly what society considered norms. What I do, is exactly opposite."},{"comment":"There is a time for everything "},{"comment":"God. This is exactly what I needed. \n\nI've been In college going on my 7th year and I still haven't graduated. Staring my 7th year tomorrow I've been extremely depressed about the fact everyone else I know is ahead of me. And that my family looks down on me due to still being In school. \n\nThis made me realize that this is my time. As long as I don't quit, I'm doing it right. \n\nThank you so much. "},{"comment":"I love this so much. Thank you. "},{"comment":"This is incredible. One of the most motivating things I've seen here in a long time."},{"comment":"I just got TimeZoned."},{"comment":"I'm cynical AF and this was inspiring to me. "},{"comment":"\"Sweetheart you haven't washed the dishes in 3 weeks.\"\n\n\"I'm jus in mah time zone bby\""},{"comment":"Thanks for the post, OP. I've been in a slump about not securing a job yet after graduation, and this made me feel better. :)     \n\nGood luck with your future endeavors of pursuing your education. "},{"comment":"As a 27 year old American finally getting back into college as a junior, this is nice to read. Half the people I graduated with are getting houses and have kindergartners already, and here I am single and degree-less. But someday I'll have a research doctorate. Thanks for this."},{"comment":"This made me feel so much better about my life and my depression "},{"comment":"This is a good friend... I wish I had a friend"},{"comment":"My mentor used to always remind me of this. He'd say, \"There is no definite timeline\"\n\nMakes me feel a lot better about graduating college at 27 and living a bohemian lifestyle since high school. \n\nWell, then again, that's because I can't get a well paying job. But that's why I went back to school :)"},{"comment":"Thanks for sharing this. Tell that person they helped thousands of internet people!"},{"comment":"What an insightful way to say that everything happens at their own time and pace."},{"comment":"As a 37 year old entering college for the first time this is what I needed tonight."},{"comment":"I am deeply moved by this. Having finally come into *my* time zone, many years after I thought I should have, this speaks to me. It's true. It's like a bow and arrow being pulled - you'll go far the more you are pulled.\n\nKeep your head up! Your time zone is coming. "},{"comment":"Wow, I needed to read this. So motivation. Very appreciate. "},{"comment":"As a 30 year old man who just finished college and is now putting his 34 year old wife through pharmacy school this means a lot to me. I was just feeling very depressed that I'm going to be living with my mother-in-law for the next 4 years, driving my beat up old truck and not taking vacations while my little brother has bought a house, just bought a brand new truck and is planning a vacation with his wife."},{"comment":"Please listen to your friend!\n\nI can attest to the \"Time Zone\" idea. At 45 many of my goals are being accomplished. Some that I forgot about! I think we gravitate to the things we like even if it doesn't feel like we are and if we keep busy, things start to gel. And, it seems like it snowballs. I'm checking shit off my bucket list more frequently than ever!\n\nNo matter what, make good use of your time! Create!\n\nThanks for the great post. It is a good reminder.."},{"comment":"Thanks OP! I will agree though that the US student visa system sucks and is harsh on the one demographic that can contribute the most to our country"},{"comment":"Never compare yourself to someone because they're worse off. That's exactly what OP is saying "},{"comment":"Just stay, odds are no one will come for him. Pretty good odds that after November, he will never need to worry about deportation."},{"comment":"Wow this applies so much to my current situation. I recently started working on my PhD, and my work load was growing exponentially. Right when I got myself motivated and ready to take on the challenge, I severely snapped my collar bone and needed surgery. I got depressed because it threw off my timing and chances to get ahead... Thanks for helping me come to terms with it."},{"comment":"Next time I'm late for anything, \"It's ok, I'm just working within my own time zone.\""},{"comment":"Idk its motivating but it could be misused to explain why you dont need to be motivated instead."},{"comment":"He's right life in most cases does not let you have your own way, usually people that are successful or are happy end up being that way by making the most of all the options that came their way they didn't potentially want or had no idea of and just say \"right this is what I've got, its an opportunity! make the most of it\", often then not you end up in a better place then were you were planning to go originally. "},{"comment":"Amazing, love this quote."},{"comment":"\"Sometimes you're ahead, sometimes you're behind. The race is long...and in the end; it's only with yourself.\""},{"comment":"Awesome"},{"comment":"You have a good friend sir\/madamn. Treasure him\/her!"},{"comment":"Unlike most posts here, this calms me down rather than stresses me out. 10\/10 friend!"},{"comment":"Thank you for sharing. Just graduated and applying to jobs and this really resonated."},{"comment":"this is extremely motivating and uplifting. Thank you for sharing this with us, and good luck with your future endeavors "},{"comment":"As I tell everyone, especially myself...the key to contentmwnt, minimal sadness and a bit of joy...is perspective. It really is that simple...in concept. In practice, its a damn riddle wrapped in an enigma."},{"comment":"I don't normally post on motivational posts but this one really hit home"},{"comment":"FUCK YEAH."},{"comment":"As someone who failed their second year of university, took a year out to work and is going back (to hopefully graduate at 24)... This is so damn heartwarming "},{"comment":"Your friend is awesome, this reminds me a famous quote:\n\n\"Never compare your beginning with someone else's middle\"\n\nFace Book, 1492"},{"comment":"I needed this! Thank you! Your friend is amazing. "},{"comment":"Wish I had a friend ~~like that~~.\n"},{"comment":"Wow! This is a really great text! It's not easy to find a good motivational post, but this is one!\n\nThe \"Time Zone\" concept is really interesting. In my opinion, it can be compared a lot to what athletes do during a run: someone likes to start fast, others start slow and then succeed... there's not the right recipe."},{"comment":"*Genuine teardrop.*"},{"comment":"Two unrelated comments.  \n1. If you are already in the US, the visa doesn't matter as long as your I-9 is valid. That is the controlling document once you are in. Of course, that means you cannot leave the country and get back in.\n\n2. I took forever to get through college because I kept changing my majors, wasn't always full time. Now, years later(late 40s), I've gone back to get my masters. It's never too late. My friends and classmates are amazed I've gone back. For me, the time just felt right. "},{"comment":"Thanks for posting this. Your friend is a good person, you too are. All the best to you!"},{"comment":"This was a great post to read. I left a really good job to pursue a career in coding that never panned out. I've been unemployed for over a year trying to figure something I'm passionate about but I feel a little better after reading your friends post. Thanks."},{"comment":"The Buddha actually saw this during his 40 days under a lotus tree. He would look at the lotus flowers and see them all in different stages of growth. He likened humans to the lotus flowers. Some are still budding, some are fully blossomed, but no matter what stage you are still as beautiful as any other lotus flower\/human being.\n\nRemember to be patient with those around you that aren't in your \"time zone\"."},{"comment":"Thank you for sharing, really helps right now."},{"comment":"I needed this so badly. I fucked up my freshmen year because I was depressed and have to redo it this year, so I'm a year behind my friends and peers. This is exactly what I need for motivation. Thanks OP!"},{"comment":"it's very kind of him, but it's also total BS.\nsome people die alone and never experience life."},{"comment":"I am from Turkey and i finished my first year in university. My girlfriend is from Sweden. I am moving to her this October. School is not for my job. I don't like lessons or so on. I want to live my own life by myself with my girlfriend. My lifestyle is playing video games, reading scientific writings, web designing and web programming and going to bodybuilding."},{"comment":"This makes me feel so much better about having to wait till I was turning 25 to go back to school. "},{"comment":"I've had tons of immigration problems lately, this really, really helps. Thank you so much \/u\/cezane279 !"},{"comment":"What a nice letter. honestly. this is almost similar to what i have said to friends before"},{"comment":"This is just what I needed to hear! Thank you "},{"comment":"Quality right here. Thank you!"},{"comment":"Wow, that was actually a great speech."},{"comment":"this is beautiful....just lovely\n"},{"comment":"more than good!"},{"comment":"Thank you so much for sharing your friend's words with us. I really needed this, not because thongs are going bad, but because I am doubting myself in all the opportunities that came up for me recently. "},{"comment":"Wise friend :)"},{"comment":"It's only motivating to guys? \/triggered"},{"comment":"R\/bestof"},{"comment":"I'm in my Time Zone! 14.5 years at a job, then quit to go to school. I'm in school with kids who are young enough to by my children (or is it I'm old enough to be their dad?), but that's alright 'cause their path is not mine to walk."},{"comment":"ITT: A bunch of whiners. Get up and work, you lazy bastards."},{"comment":"Thanks for that post :) what I needed to hear "},{"comment":"My friend tried for citizenship too and all i said was \"why the fuck do you want to live here anyway\" lol"},{"comment":"yo ill marry you so you can stay"},{"comment":"This was very empowering for me specifically. I'm struggling with drug addiction and it's an absolute blow to my self-esteem considering I'm still in school at 23 and people my as have already graduated and landed jobs. However, this post and talk of our own \"time zones\" really helps me. I mean for gods sake I'm in a better place than most people and I'm studying chemical engineering! I can do this! The past is the past. Time for the future."},{"comment":"OP do you love the Lord and live according to his purpose?  I assume your friend does based on his Bible reference.  Love this note!"},{"comment":"As a 23 year old, going through my second undergraduate degree (neither of my majors are going to make me a doctor or an engineer and that's not cool in India), this hits a fucking home run. \nI'm going to use this to calm down. Just calm down and work efficiently. "},{"comment":"Hold on! Be strong! You can win the Darwinist race of life with your weak ass blood and DNA.. Not"},{"comment":"Also, don't be depressed about not having a student visa to the US. Education is expensive and a degree will most likely not translate to getting employment. Go somewhere else, where there is preferably free or much cheaper education."},{"comment":"[removed]"},{"comment":"I wish i had the money to give you gold, but i don't. The only thing i can give you is my thanks, for posting this. It helps. <3"},{"comment":"Well figures, go through the system the right way and get denied, but allow people to pour illegally across the borders unmolested.\n\nStupid is as stupid does."},{"comment":"Thanks man."},{"comment":"Take your time\n"},{"comment":"OP are you a grad student?  If not,  you may want to consider Canadian university.  You may not have to start all over,  but it depends on your major.  "},{"comment":"At least we are still rejecting people. I was beginning to wonder."},{"comment":"Too bad everyone else is actually in the same time zone and moving faster than you tho"},{"comment":"Motivates me to be more xenophobic..."},{"comment":"Sounds like you wrote this yourself"},{"comment":"America is the greatest country in the world.  Not anyone can come in.  Getting in is a huge achievement for the average person."},{"comment":"[removed]"},{"comment":"And someone just got their visa rejected. (Sorry I couldnt resist!) "},{"comment":"Sorry, not a fan.  It smacks of fatalism to me.  Shit happens is comforting but not motivating.  Give me your downvoted."},{"comment":"[removed]"},{"comment":"Stay Strong, Your Time Will Come ! Kenya is 2 hrs ahead of Nigeria, but it does not mean that Nigeria is slow, or that Kenya is fast. Both countries are working based on their own \"Time Zone.\" Some one is still single.. Someone got married and 'waited' 10 yrs before having a child, there is another who had a baby within a year of marriage. Someone graduated at the age of 22, yet waited 5 years before securing a good job; and there is another who graduated at 27 and secured employment immediately! Someone became CEO at 25 and died at 50 while another became a CEO at 50 and lived to 90 years. Everyone works based on their 'Time Zone' People can have things worked out only according to their pace. Work in your “time zone”. Your Colleagues, friends, younger ones might \"seem\" to go ahead of you. Don't envy them, it's their 'Time Zone.' You are in yours! Hold on, be strong, and stay true to yourself. All things shall work together for your good. You’re not late … you’re very much On time!\n\n"},{"comment":"[removed]"},{"comment":"Check with the consulate's website, usually it is about two weeks for US citizens. Not sure where you're from, but here is the link to the [LA consulate](http:\/\/www.consulfrance-losangeles.org\/spip.php?article801). In addition to reading the 'processing times' section, be sure you have all the other documents besides campus France that are required too... Otherwise you'll have rushed the appointment for nothing. \n\nAlso, sometimes the consulate can process a visa much faster if they're not too busy... But January could be busy since so many programs in France begin in February. \n\nGood luck!"},{"comment":"Hi there,\n\nI went to the LA consulate to do my visa procedure, and I waited less than a week. (Gave them my passport on a Thursday, got it the next Tuesday I think). This is obviously a best case scenario, so expect that the process will take a little bit longer. However, you never know when something will go wrong or get delayed, so it's best to do it sooner rather than later. \n\nMy advice: be very very thorough with all of your documents. The French are big sticklers for paperwork. Have copies of your copies, and basically just be as prepared\/organized as possible. The website of whatever consulate you'll go to will have all the requirements, and sticking to this list is your best bet for a speedy decision. \n\nLet me know if you have any more questions!"},{"comment":"At the new york consulate it took exactly a week for them to give me my passport back with the VISA inside. I would mail your stuff to campusfrance ASAP, though, because even if you overnight it, it takes them 3 weeks to process it. Not mailing my payment to campusfrance fast enough almost cost me my visa, so be careful! Also, at the NYC consulate i had to schedule my appointment way in advance because they were booked for a few weeks ahead."},{"comment":"It's a couple month procedure to get everything sorted. Do it as soon as you know you are going or not."},{"comment":"[deleted]"},{"comment":"Hello from Issy-les-Moulineaux!\n\nYou need to be a legal French resident for 2 years to become eligible for citizenship on the basis of having completed a French masters course. Time spent with on an student titre\/carte de séjour is not always considered as \"residence\" for naturalization purposes (often times, students do not consider France to be their home or simply can't demonstrate that it was and the time ends up not being counted) and every prefecture does their own thing, as I'm sure you know.\n\nThere's also the issue of the requirement that you showing your integration into France. Horrible as it is to say, having a non-French spouse is not going to help that.\n\nUsually people who are interested in living in France permanently obtain a job (since the Prefecture will not want to grant naturalization to someone who is unemployed) after graduating and stay for another year under APS, then switch to *passeport talent* or another status and then try to naturalize after building a solid dossier."},{"comment":"You have probably been away for too long, besides that you would have had to have been in France a significant amount of unbroken time (meaning you don't leave for long periods of time, like you have now) to begin with. Not sure how long you studied, but 5 years, or possibly 10 in your case as a non-EU citizen (again depends on more specific information), is the standard bare minimum across the Schenghen Zone - generally 5 years of holding permanent residency is required...which means either having an EU partner, which you don't, or having already been there long enough to get permanent residency in the first place. In some EU countries, eg. Czech Republic, student visas\/ residency permits only count for half the time (eg if you studied for 4 years, it would be counted as 2), so you should check that too. \n\nHave you looked at the OFII site and related immigration info online in French and possibly in English? \nYou should call the OFII, they would have your file and all your information, much more than what we have, and could give you the right information relating to your profile. Or if you're near one, go to your local French consulate for advice. "},{"comment":"I'm an au pair living in France for a year on a student visa, and my passport arrived back to me only five days after my appointment. I'm not sure if it's different per consulate, but the one in DC stated it could take up to 14 days. I'd probably take that chance though over staying in France without a visa, and I don't think there is any way to get a visa once you're here. "},{"comment":"You could try running it through one of those visa expediter services. You'll have to pay a bit more but they could get it back to you quicker.\n\nI applied through the NYC Spanish consulate for mine and it took about 2-3 weeks for it to come back (they said it could be up to 6 weeks).\n\nCheck their website to see if more appointments come up, sometimes people cancel and you can grab their spot."},{"comment":"This is not constructive but are you going to IAU in Aix? I spent last spring there - once you get this visa done look forward to a great five months and a very very un-bureaucratic school staff in comparison!"},{"comment":"so totally stalked, but I see you're doing IAU this semester... so am I! :)"},{"comment":"You normally have to apply for a visa while you're in the country you permanently live in.  That's why they're asking about a residence permit (\"lichna karta\" \/ \"лична карта\" in Bulgarian) - it would be proof you live in Bulgaria.  \n\nYou don't live in Bulgaria; you're only visiting.  So you have to apply for an Italian visa at the Italian embassy in Vietnam.  Sorry."},{"comment":"Last semester I applied with Hochschulstart, and I got most of the acceptances around a week to two weeks after the deadline! This semester is my first time applying with Uni Assist as well, because I'm changing schools... so I really hope it's soon :o I'm nervous too. good luck, hope you're accepted to your programs!!"},{"comment":"Did you receive an \"evaluation report\" from uni-assist when they notified you that they would be forwarding your application? \n\nBecause if so it states on the bottom:\n\nWith this letter you can apply for a study applicant's visa at the German Embassy \/ German Consulate in your country. However, the letter does not grant a legal claim for the issuance of a visa.\n\nSo if you did receive this paper I would try to apply now. "},{"comment":"When I applied for my bachelors degree I got an acceptance letter around mid august from all universities I applied to."},{"comment":"Even if tuition were completely free, you'll need significantly more money than that, you'll need to demonstrate each year that you have $9-10k (to show that you can support yourself) just to get the student visa.   \nAlso, you'll need a B2 or better on the TCF or DELF (a french test) in order to be admitted to a French university, which means basically that you can do university-level study in French.    \nUnless you intend to abandon the US forever (hey, not a bad idea) or have no plans to continue on, then for many programs (ie. the three years ones) you'll have to complete a Master's degree to get the full 4 year degree, so as to return to the US for further schooling.     \n There's also the cost of living to think about, even if you get a part time job somehow (this won't be easy for a foreigner).  France offers rent subsidies, but my landlords always refused to sign off on them, either because they were subletting to me and couldn't or because they were offended that foreigners would be getting that money, so you can count on these for visa purposes but not in real life.   \nWish you luck, it's a great country and a great place to study.  "},{"comment":"Even with free tuition, you still need to have have proof of solvency of about 9000euro\/year for your student visa."},{"comment":"Even if tuition was \"free\", you'd still need to pay for food, lodging, etc."},{"comment":"You want to come and sponge off an EU country and we’d want you...why?"},{"comment":"You need 5x to 10X the money you have to even consider this.\n\nYou're fluent in all manner of French, right?"},{"comment":"I saw Michael Moore’s movie Where to Invade Next I believe he mentioned Slovenia has free university for all, education in English and a very reasonable cost of living.  It’s not France, but it is Europe and cheaper than USA."},{"comment":"[Start here](http:\/\/www.mastersportal.eu\/)"},{"comment":">Canada has 130,000 students from India now, compared to 20,000 in Britain, 70,000 in Australia and 186,000 in the U.S., which has almost 10 times Canada’s population.\n"},{"comment":"This isn't new, so what's going to be done about it? "},{"comment":"Everyone in the game knows this. The government knows this, as do those in India and China crafting fraudulent educational credentials for prospective applicants, as do the applicants and their families, as do the bogus (and semi-bogus) educational institutions churning out worthless degrees here, as do the legitimate educational institutions subsidizing their overhead with legions of high-paying foreign students, as do the instructors that watch students who cannot even speak English hire others to plagiarize assignments, as do the immigration consultants that make pots of money off this scam, as do the local students that cannot enroll because of a finite number of class seats .... and on and on and on ...\n\nLots of people making money, lots of migrants using education as a visa scam, lots of new Liberal voters, and **all of it** greased by fraud."},{"comment":"Indian here, I was almost one of them, thought about going to some college in Ontario for a 2 year diploma and make money. There are fairs here, where agents will put a pretty convincing argument and naive parents usually agree. Agents in India usually make 2000-4000 CAD commission per student. Better to go to some university and earn a masters or bachelors, imo. 70% of people usually go for a 2 year diploma."},{"comment":"We Canadians are the type of people to just willingly give away everything we have until we have nothing left.\n\nFor the first time in my life I am genuinely ashamed of my country and where it's headed."},{"comment":"This seems like a simple problem to fix while still fulfilling the intentions of the government. Only allow student visas for accredited colleges, universities, and technical schools. For individuals on student visas give preferential treatment to get a working visa in Canada upon graduation. If the individual came to Canada on a student visa, graduated, and found work in their field within Canada, then give them preferential treatment in the permanent residency process. "},{"comment":"Not sure how they came to the conclusion that somehow they are being exploited for working under the table, they are also exploiting Canadians by doing so, plenty of blame to go around. "},{"comment":"130,000 students from India alone?? That is insanity, it really is a race to the bottom with this country"},{"comment":"I feel like people are misunderstanding this. The people mainly being exploited are the Indian students or at least that is what is being heavily implied in the article. \n\nIt doesn’t go into specifics but they seem to be doing crappy courses with low chances of actually being able to emigrate. \n\nEdit: I welcome down-votes from people who didn't read the article...lol. "},{"comment":"Nothing wrong with legitimate student visas, for students who were admitted to an accredited Canadian school.  A large number of foreign students simply indicates the high quality of Canadian schools, something which is borne out by internation education rankings.\n\nBut as the article points out, it is necessary to crack down on illegitimate Canadian schools, for the sake of upholding the reputation of Canadian education.  If an international student is in Canada on a student visa but not receiving an education, then they shouldn't be here; and it's the fake schools that we should be cracking down."},{"comment":"Study permits. Not visas..."},{"comment":"Don't really understand what the deal is. International students bring money into this country. Why are people complaining about this? "},{"comment":"Poor Indian students getting scammed...we need more official government avenues for these students if they want to study and work here"},{"comment":"News cycle already started 4 am talking points have already been scripted"},{"comment":"Can confirm, in Australia. \"Links to ISIS...\" 5 minutes later \"No evidence of others plotting, seems like a lone wolf...\"\n\nMy liberal Australian mother: \"How could it be a lone wolf attack if he has ties to ISIS?\""},{"comment":"deleted  ^^^^^^^^^^^^^^^^0.7070  [^^^What ^^^is ^^^this?](https:\/\/pastebin.com\/FcrFs94k\/82559)"},{"comment":"This one will fall under the “mental health” basket that the Australian government and media always run with. The funny thing is, I truly think it is. Not the same way they want you to believe. That’s why I don’t think islam belongs in a modern society."},{"comment":"His name is Muhammad. I’m shocked. "},{"comment":"Funny how they actually managed to prevent an attack when politicians were the ones being threatened\n\nOrlando...Manchester...Stoneman Douglas...all of those perpetrators were previously known to be problematic, yet the “authorities” didn’t do shit"},{"comment":"#Religion of Peace"},{"comment":"Yeah..... Do It! Ol' Malcolm's DeRp StaTe & he'd be doing us & Clinton Foundation a favor. Hey, do U think?"},{"comment":"Even if he succeeded I don't know if it'd change anything for those people"},{"comment":"Trump made em mad, we have to show we are not their enemies by slandering him harder.\n\nJust saying..."},{"comment":"https:\/\/www.law.cornell.edu\/uscode\/text\/18\/922\n\n> (2)Exceptions.—Subsections (d)(5)(B), (g)(5)(B), and (s)(3)(B)(v)(II) do not apply to any alien who has been lawfully admitted to the United States under a nonimmigrant visa, if that alien is—\n\n> (A) admitted to the United States for lawful hunting or sporting purposes **or is in possession of a hunting license or permit lawfully issued in the United States**;\n\nIt's legal to own any legal firearms as long as you keep your non-immigrant status and hunting license active. Don't let any of those expire. "},{"comment":"ahhh fuck yess. Americanize her so that she can't go back to her home country\/live anywhere else that doesnt have a 2nd Amendment in their Constitution. I love this."},{"comment":"Which state? \n\n\nYou will have to do some digging but I have a friend (foreogn) who told me he did some research and it involves getting a hunting license (Texas). I'll ask him but he is here as a grad student. "},{"comment":"Nope.\nNonimmigrants according to the ATF may not purchase or posses a firearm.\n\nPeople coming for the purpose of hunting, competition or law enforcement duties can posses a firearm but can not purchase it.  But they must be here for that specific purpose.  F1 would not qualify for that.\n"},{"comment":"Which uni are you at? If you’re at Dal shoot me a PM! I just got here yesterday and already I can attest to everything you’ve said. Is love at first sight a thing with cities?!?!"},{"comment":"I hope you enjoy it, it really is a great place to be. "},{"comment":"Where are you originally from?"},{"comment":"Welcome to Nova Scotia :)"},{"comment":"Thanks for choosing Nova Scotia!"},{"comment":"Welcome to Halifax dude! Hope your University years treat you well and that you'll always remember Halifax and Canada with fond memories."},{"comment":"Welcome to the Maritimes! I hope people continue to uphold their reputation. :)"},{"comment":"Hey! International student here as well (I go to SMU though), going into my second year. Great to hear your first impression was a good one. Best of luck in your first year!"},{"comment":"Good luck at uni!"},{"comment":"Welcome to Nova Scotia! We still have our assholes but don't let them get you down. Most people here are great. "},{"comment":"Welcome and have a great first year at school!  :)  "},{"comment":"~~According to the US consulate website, you need at least $30,000 in your account to be considered financially secure.~~ Are you planning on attending a language school on the student visa? \n\nedit: According to [this](http:\/\/www.japaneselawtranslation.go.jp\/law\/detail\/?id=2006&vm=04&re=01) site, there isn't a set requirement on financial assets, but having more is definitely better. I still think $10K is not enough and the minimum you should aim for is $20K. "},{"comment":"This appears to be a post about securing a visa to legally live or work in Japan. Please consult our [visa wiki](https:\/\/www.reddit.com\/r\/movingtojapan\/wiki\/visas) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/movingtojapan) if you have any questions or concerns.*"},{"comment":"1 million JPY for every 6 months.\nCheck money value regularly."},{"comment":"You will need a degree. A diploma does not sound like a degree?\n\nHowever, if you found a company that was willing to employ you in your field of expertise, then you could quite possibly achieve that. The main caveat is that you would need 10 years of *paid and documented* evidence of experience in your field of expertise; and the company employing you would need to demonstrate that they were employing you to exploit I mean harness that expertise.\n"},{"comment":"You need a total of 10 years of experience to qualify for a visa without a degree. You have 2 years of schooling + 6 years of work so that adds up to 8 years of experience (assuming your work & schooling are all relevant experience.) At this point you can either go back to school for 2 years and finish a full undergraduate degree or you can work 2 more years to get the total of 10 that will qualify you.\n\nOf course you actually need a job in Japan that is willing to sponsor you but that's a different issue entirely."},{"comment":"[removed]"},{"comment":"Pakistani studying in Canada here. I applied in Dubai because that's where we were living at the time. I applied using the CIC's online service in mid-May and got the visa in mid-August. I have a family friend who applied in Pakistan and ended up having to defer a semester because the visa didn't come in time–but it did come. That seems like what may have to happen in your case, unfortunately. It sucks and I'm very sorry but there's really nothing that can be done. The visa will hopefully come but I would contact the university to defer.\n\nI'll have to ask a personal question. Are you\/your family in a solid financial position? Canadian immigration is very weary of giving study permits to people if there's even a chance they'll end up not being able to afford the tuition, and therefore may start working illegally to make ends meet."},{"comment":"go to the canadian embassy with proof of acceptance and i.d. \n\nyou might've missed some documents in the visa application. if you've got questions about universities in canada feel free to dm me, I'm canadian. "},{"comment":"They've been rejecting alot of student visas of Pakistani students. I think we even complained to the government. An educational agent told me that 48\/50 visa applications got rejected and they've stopped telling people to go to Canada and go to the USA and Australia instead"},{"comment":"I applied in May. Got it this August. Leaving in less than a week.\n\nThe processing time is average. Some cases will take longer. Some won’t. \n\nIf you have any questions, let me know."},{"comment":"Which university are you planning on attending, and what program. Unfortunately Pakistan doesn't have a good image, so it takes comparatively more time. Hopefully things will change with PTIs government. I have seen Pakistani international students in my university, so there is hope. Like someone else has suggested, go to the embassy and tell them that you really want to study in Canada. "},{"comment":"Pakistani currently living in Canada who came here to do masters and now have settled here \n\nIt took them almost 1 year to process my Visa. When I applied, they asked me for more documentation ... After providing full documentation it took them 8 months to process my Visa. I had to defer my admission twice. Even then they didn't issue me visa until it was 2 days were remaining for fee submission. Super fucked up situation. \n\nAnyway the point is that if you completed your file properly then don't worry, you will get your Visa. Canada just do some extra check on every Pakistani applicant. \n\nFeel free to send me a pm if you have any specific question regarding application preparation of anything else."},{"comment":"I've never applied for a student visa, but IIRC Pakistani visas are processed at the London visa office which is known to be slower than most other visa offices.\n\nYou'll get it. Be patient."},{"comment":"I applied from the GCC aswell and this waot time is normal. Some time soon they should ask you to do a medical at a certified clinic.\n\nIt took a long time for mine to come aswell, I think 3 and half months but I did everything on my own.\n\nWorst case scenario you have to defer a semester which is not that bad."},{"comment":"Dua mangoo"},{"comment":"I hope it comes through for you! I’ve heard of many Pakistanis not getting visas even though they get into good universities. Meanwhile, Indian students get into random colleges and come here within a month."},{"comment":"I think that they put the semester dates into consideration. I’ve already applied for a student visa and my interview was near the end of June and I still haven’t received any replies from the embassy yet (which is around 3 months now). But I like to believe that it doesn’t matter since my courses there will start in late October anyway.\n\nI also know two other people who applied last year and already got their visas. One took like a month and half and the other took three months and half. So I guess it’s not the same for everyone.\n\nAnyway, try to relax and not get too anxious or worried about it since the process will surely take its time. I know it’s kinda hard but if it’s meant to be, it will and... good luck!"},{"comment":"Hey there, it took about two weeks to get my visa once I had all my documents submitted. You can still apply for unis without the visa, that shouldnt hold you back. Good luck!"},{"comment":"I got my response maybe 2 weeks after the interview. It differs from one person to another. "},{"comment":"Did you apply for a gap year from the school that accepted you?"},{"comment":"As a fellow international, I totally relate about having almost no resources. It sucks dude but what can we do. Hope everything works out for you, all the best!!!"},{"comment":"If you already have all tests etc ready, look towards Canada, AU, NZ, and EU universities.  Other places if you want to have a great adventure is Singapore, China and HK. All mentioned have great schools and learning environment. "},{"comment":"Have you contacted the university you’re going to? They may sometimes be able to do something to help you (write a letter of recommendation, for instance)."},{"comment":"You probably don't know much about working\/living permanently in the US after college, but US permanent residence is very difficult to obtain and to a large extent based on random chance\/a lottery. If you wish to live outside of Peru in the long run, then it may be for the best that you don't do your undergraduate degree in the US. \n\nLook into the UK, Canada, or EU countries for countries with good schools and easier permanent residence. Let me know if you'd like more details. "},{"comment":"Similar issue here, I totally understand the amount of stress you put yourself under. I’m still waiting for my Dutch visa and my future looks grim af right : ( "},{"comment":"I got my visa with no issues, but if I hadn't I would have immediately contacted my immigration officer and had him go to bat for me. Surely there's some way you can reach out to your school and ask their immigration personnel to help you?"},{"comment":"If the school your going to have a student council, post this there. I'm sure they will relate, and their voice will reach the authorities (deans, etc...) I really think it should help."},{"comment":"international student resources suck where I go, so I feel this post! I hope everything works out "},{"comment":"I don't understand how America \"failed you\". Regardless, I really hope you get it all worked out. Best of luck!"},{"comment":"Moving to America isn't a human right, even if you got accepted to a uni here. Dont say \"America failed me\"."},{"comment":"As it was voluntary, then you should not have any problems.\n"},{"comment":"This appears to be a post about securing a visa to legally live or work in Japan. Please consult our [visa wiki](https:\/\/www.reddit.com\/r\/movingtojapan\/wiki\/visas) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/movingtojapan) if you have any questions or concerns.*"},{"comment":"I'm not a lawyer, but I can't imagine any problems. Apply for some jobs and see what happens :)"},{"comment":"I can't imagine why they would have an issue. You didn't breach any conditions. Always up to their discretion though."},{"comment":"This sounds extremely sketchy, I'd strongly advise against doing this since you can apply independently yourself if you have a genuine case.\n\nEDIT: Just saw that you're applying for a diploma, it's going to be very hard to stay afterwards if you go down this route.\n\nEDIT 2: US college is very expensive, I'm not sure I'd recommend that route. The other route is by getting a job here, but it sounds like you might not have the skills for it."},{"comment":"Pineperahan ka lang nila.\n\nThere is no reason that you can't just apply for a student visa yourself.\n\n> My question is, with this amount of money, would it be better to just go for a work visa and not study so i would have a legit job right away?\n\nYes. But you don't provide any information about your degrees or work experience to suggest you're eligible to directly apply for one.\n\n> And with this much money, would it be better to go to other countries? Because honestly i'd rather live in the US.\n\nDepends. $6k is a lot in some countries and nothing in others..esp if you have to spend a big portion of that on flight and accommodations.\n\nGanun din yung magiging prob mo sa US. Are you trying to go as a student? There's no info about your background yet that suggests you can directly apply for a working visa. And $6k is not really enough to go as a student to either place."},{"comment":"The Australian embassy is responsible to decide if you will get a student visa or not. All students are allowed to work. The agency does not help you to \"get a student visa easily\". All they do is collect your paperwork and then submit it to the Australian embassy. You can find all information about the paperwork here and submit it to the embassy yourself:\n\nhttps:\/\/philippines.embassy.gov.au\/mnla\/Student_Visas2.html\n\nhttps:\/\/www.homeaffairs.gov.au\/Trav\/Visa-1\/500-"},{"comment":"You can easily apply for the student visa yourself, no need to go through an \"agency\" especially if you have all your requirements (primary of which is your acceptance to a university\/program) ready. And yes, even diploma courses are expensive in Australia\/US. I honestly don't know of a decent uni\/program that you can get for $6k, which already includes airfare and insurance.\n\n&#x200B;\n\nI've heard of people going to Australia on a student visa and have gone on to work in the service industry.  You are only allowed to work a certain number of hours a week\/not full time. This would also not necessarily qualify you to get a permanent residency right away.\n\n&#x200B;\n\nGoing to the US on a student visa would not allow you to work full-time either. And getting a work visa on either country would require you to have a skill in high demand, and usually an employer to sponsor you. This is not the easiest route to go by."},{"comment":"The student visa is just that, a visa designed so you can go to Japan to study and if needed do some work to assist financially. You shouldn't be planning to work full time, if that's your intent then apply for a working visa."},{"comment":"> I read that I need to enroll myself in class for 35 weeks out of the year which would dent my chances of working full time here in that country.\n\nYou're not supposed to work full time under a language student visa. \n\nSo yeah, your chances are being \"dented\" intentionally, because too many people are trying to game the system and work illegally.\n"},{"comment":"Read up on visas again and the rules that come with each visa. Not sure what you're trying to say, but how did you even think about working full time when you're going to be a student? "},{"comment":"Thanks for the feedback though"},{"comment":"i mean you can work for 28 hours then do 10 hours of under-the-table work like language cafe or bar tender\/bouncer....or even independent english lessons..."},{"comment":"[deleted]"},{"comment":"[deleted]"},{"comment":"Congrats OP! I will take a moment to share in your excitement! Check out the sidebar for a pinned post called \"Moving to Halifax\" lots of info there! "},{"comment":"Hey,\nI moved to Halifax for school at NSCAD last year i have a couple weird tips:\n\n-The weather can change quickly in the fall \/ winter. get a good, light rain jacket. something small enough to fold up and put in your backpack. It Tends to rain more than it tends to snow. I found winter to be really wet. all. the. time. you will always be damp. Also, waterproof shoes and socks which will absorb sweat. it sucks to have damp feet while sitting in class.\n\n-Dont leave fruit out on the counter. Halifax is the perfect climate for fruit flies and ants. even if you keep your place really clean you could still get them. all fruit should go in the fridge."},{"comment":"Exciting!! Congratulations! \n\nDon't be afraid to reach out to profs and student groups on campus. If you have a need for something, no matter how strange you  might think, there's probably a resource to help you out."},{"comment":"Remember Tim Hortons is not Canadian anymore. Ask around and make sure you stop by local cafes and restaurants!"},{"comment":"You'll have lots of fun!"},{"comment":"Congrats!! What country are you coming in from? I’m interested to see that 17 year olds can be accepted into university! Dal is a pretty big place as well so finding friends shouldn’t be too much of a problem! Have fun in Halifax! ❤️"},{"comment":"jimsy, we've been hosting international students for the last 12 years, we've had 18 students live with us and we've seen just about everything when it comes to getting used to a new country. PM me and I can give you some contact information. Good luck with your studies, it is a very exciting adventure you are about to embark on. "},{"comment":"Get a good rain coat, something bright in yellow or red, but also compact enough to fit in you back pack. It rains and it comes out of nowhere sometimes. Helly Hansen is my recommendation. Rain pants are handy too. Umbrellas are useless because of the wind. When you get here, don't sign up for a phone contact, they are not worth it, I'm with Public Mobile, lots of data, can change it monthly, low cost, but you have to bring your own phone. The daily grind is a great spot for coffee or beers and they are really student friendly. Enjoy yourself here, it's a great city and Dal is a great school, if you have any questions please ask, I just graduated in the spring and might be coming back for another program in the fall."},{"comment":"Are you going to be living in residence? If not you should REALLY take advice on where to live "},{"comment":"Congratulations! How long did you wait?"},{"comment":"My own recommendation is when getting a phone plan get a small amount of data so you can figure out how to get to places when you aren't in a Wi-Fi area. \n\nGoogle maps works wonders in the Halifax and surrounding areas, and if you will be relying on the bus it will tell you the most efficient way to get from your current location to where you want to go and the transit app is a huge help too!"},{"comment":">  it’s been my dream to study abroad.\n\nWe call them women in Canada."},{"comment":"Buy yourself a bike when you get here. Hands down the best way to see the city and get your bearings. If you look on Kijiji you can find some good deals on used road bikes. "},{"comment":"What's interesting is comparing this to their original Election manifesto https:\/\/www.labour.org.nz\/immigration\nChanges to student visas (fall of 6,000 - 10,000) and post-study work visas (fall of 9,000 - 12,000) were supposed to result in a significant drop in numbers. Their policy included \"Labour will limit the 'Post Study Work Visa - Open' after graduating from a course of study in New Zealand to those who have studied at Bachelor-level or higher.\" They also planned to eliminate post study work visas for those doing Grad Diplomas as that was one of the main pathways that was leading to a drop in the average skill level of migrants.\n\nHowever none of those changes took places. Low level diploma courses still will receive a 1 or 2 year open work visa. The same with Graduate Diplomas. The predicted drop in student numbers 1,200 ! Wow way to live up to your election manifesto !\n\nIt wouldn't surprise me if we didn't actually get a big increase in numbers. Those doing degrees will get a three-year post-study open work visa which will let them compete in the job market against local graduates. Most grads don't stay in roles that long, so there seems to be no incentive to hire a local grad over an international student with an open visa. "},{"comment":"I mean - easy does it is sensible.  I like that theyre making the change relatively quickly.  Id like to see an 18 month period to gather data post implementation followed by further revision as appropriate.\n\nI doubt that will happen in a million years though..."},{"comment":"It's far too expensive to study here. My flatmates are Korean and they pay $22k per semester. Almost $150k for the three year bachelor's, and keep in mind it was compulsory for them to study English tertiary until level 4 first (which was $10k a semester) "},{"comment":"Could just replace the title of every politics-tagged post with \n'Bandaid fix to much bigger problem: Government confirms changes on way'.\n\n"},{"comment":"This article also notes that *EVERY* current international student will receive a 3 yr open work visa on graduation (regardless of what the previous rules were). And those on employer sponsored visas can apply to change it to an open visa.\n\nhttps:\/\/www.radionz.co.nz\/news\/national\/363766\/exploited-students-urged-to-change-work-visa"},{"comment":"[Post-study work rights emphasise skills NZ needs](https:\/\/www.beehive.govt.nz\/release\/post-study-work-rights-emphasise-skills-nz-needs). Press Release: New Zealand Government.  8 August 2018. [Scoop](http:\/\/www.scoop.co.nz\/stories\/PA1808\/S00095\/post-study-work-rights-emphasise-skills-nz-needs.htm).     \nChanges to post-study work rights for international students: Press releases by [Immigration NZ](https:\/\/www.immigration.govt.nz\/about-us\/media-centre\/news-notifications\/changes-to-post-study-work-rights-for-international-students) and [MBIE](http:\/\/www.mbie.govt.nz\/about\/whats-happening\/news\/2018\/post-study-work-rights-changing-for-international-students).    \n[Foreign students' right to work after study cut back](https:\/\/www.stuff.co.nz\/national\/politics\/106115390\/Foreign-students-right-to-work-after-study-cut-back). Stuff. August 8 2018.    \n[Revealed: The Government's first immigration changes to 'help' students](https:\/\/www.newshub.co.nz\/home\/politics\/2018\/08\/revealed-the-government-s-first-immigration-changes-to-help-students.html). Newshub. 08\/08\/2018. [Post](https:\/\/redd.it\/95j0gd).    \n"},{"comment":"That's not a problem. Bring your documents in case they have questions."},{"comment":"What do you mean \"I'll be getting\"?  \nWill you have it with you when you arrive?\n\nOther than that, a Schengen visa is a schengen visa. You can enter Schengen countries with it wherever you applied for it. Since you're staying longest in Germany, you did the right thing by applying at the German embassy.\n\n\"I've heard some say\" --> What did they say and how reliable are they?"},{"comment":"Shouldn't be a problem.\nJust have some proof ready that you'll spend your time studying mainly in Germany. That's the most I can imagine them asking for."},{"comment":"Canada now has about 500,000 foreign students. In comparison the USA has only a million, despite having thousands of more universties and colleges. They aren't coming to Canada for the quality of education. \n\nA friend just got back from a job in Timmins, Ontario and reports that the local community college up there is now flooded with students from India. This is great if you're employed by the college (job security) but not so great if you're  local trying to get an education. "},{"comment":">Deol said the other side of the phenomenon is that Indian foreign students who break the rules by working long hours are adding to **large “underground” ethnic economies in Ontario and B.C.**\n\n\"ethnic economies\" - A good example of this in BC is the way we're not allowed to have Uber or Lyft but multiple *Chinese language only* ride sharing companies have been operating openly with impunity for years. "},{"comment":"The paradox of the ouroboros."},{"comment":"Congratulations. Hope you do well in your studies.\nBtw, if you haven't made a post about yourself, consider making one.\n\nCheers.\n"},{"comment":"French here. Welcome and good luck for your studies :-)"},{"comment":"Congratulations,  I hope you succeed there.  "},{"comment":"Je ne sais pas où tu vas étudier en France, mais ne t'attends pas à être entouré que de \"blancs\" (ça dépend de la région\/ville bien sûr). La toxicité de l'Afrique du Nord\/Moyen Orient est présente ici aussi à différents degrés\n\nLa temptation serait de retourner vers ces espaces arabes\/musulmans comme une sécurité dans un pays que tu ne connais pas nécessairement. Un conseil: évite ça. Ça ne serait qu'une consolation temporaire avant de retrouver la pression sociale du \"bled\". \n\nC'est clair que la France c'est infiniment mieux qu'un pays musulman aussi libéral soit-il. \n\nJe raconte ma vie là lol Bonne chance en tout cas, j'espère que tu excelleras dans ton domaine d'expertise :) \n\n\n\n"},{"comment":"France is awesome!!! Enjoy the country of love and hedonism!!! :)"},{"comment":"Congratulations! I’m very happy for you! One of my friends made it out too and is very happy, I wish you the same happiness! Good luck with everything!"},{"comment":"So happy for you!"},{"comment":"Congrats, best of luck!"},{"comment":"Allez bonne chance!"},{"comment":"Bonne chance! :) "},{"comment":"France is kinda of the middle east now "},{"comment":"Live it up!!!!"},{"comment":"Congrats. That ought to be a relief."},{"comment":"Bienvenue chez les frenchie "},{"comment":" Oh another bougnoule in France. Just what we need!"},{"comment":"From the US point of view this insurances are dirty cheap, just get whichever you like"},{"comment":"That is quite strict indeed. Are you applying for a student visa for Spain through a study abroad program or directly through a university? In the acceptance letter they normally have a part in which it states that health insurance coverage will be provided on behalf of the program and coverage starts from day 1 of the program until the last. Or that's how it's been all the times I've applied to study abroad. "},{"comment":"You need health insurance in the US too.. "},{"comment":" The current law on foreigners already allows revoking or refusing to prolong the student resident’s card if he\/she “prolongs excessively his\/her studies without showing sufficient progress.’’ But this last disposition has been refined. Students’ progress will now be judged on the basis of their results and of an eventual individual study project.  \n \n\n&#x200B;\n\nseems reasonable"},{"comment":"In Germany and the Netherlands there is a special visa for non-EU graduates from the local universities for 6 months-1 year to give them an opportunity to look for a job in the local market. It also let employers deal with these job applicants the same as EU ones. \n\nIn Belgium however, there is no such thing. Student visa will typically only run until shortly after graduation (2 months). Many people therefore delay their graduation to look for a job and it's difficult for employers to deal with them as it is the same as hiring someone coming directly from their home country. \n\nAs someone in this position, I'm biased. But I don't agree with the Belgian government as they prefer companies in Belgium to hire graduates from a third-rate university from an EU state (often with broken English) than hire students from third-world countries who graduated from KUL\/UGent etc  with good grades and with successful internships in the local market. \nAs the situation in Germany and the Netherlands is different, this isn't EU policy but what the Belgian government (Mostly NVA) want. "},{"comment":"Theo says \"they tend to fail\". How about some numbers.. It shouldn't even matter if they fail. What should matter is that they made a real effort."},{"comment":"I believe you’ll have to send in an official letter that you receive from your school that shows they have received your approved FAFSA. I would recommend contacting your university to see how they handle this. I had to fill out additional paperwork through my Uni, which was basically a cost accounting spreadsheet to say how I’d be using the money\/how much I’d need, then sent that with the entrance counseling and MPN to them. It took too long to get the certified letter from my Uni before I had to apply for my visa, so I ended up having to use the money I had (luckily) in my savings account to prove I had enough - though I had no intention of using it because it’s all I have. \nI think you’d be cutting it really close, but see what your school says. Their process could be totally different. "},{"comment":"Call the university that you are going to, they will help you and give you all the information you need. \n\nIt’s definitely possible, don’t worry. "},{"comment":"As long as you pay for priority processing you should be okay. I am using federal and private loans to cover my cost of living and tuition. My school told me to check that I had the funds in my bank account. My application was successful and no questions were asked about funding. "},{"comment":"IIRC, when I applied via from the US a little over 2 years ago, they didn’t ask for proof of funds, I don’t know if it still applies, but applicants from a list of countries don’t have to show proof of funds. Don’t know if that still applies though. "},{"comment":"Hey, did everything work out alright? Did your school help you through the loan certification and your Visa application?"},{"comment":"As long as you have your visa and it isn't expired, you can come in whenever. The validity starts on the date of issue "},{"comment":"None. If you've got the CoE you're good to go. "},{"comment":"That’s great news! Don’t worry now you will get the student visa from the embassy.\nKeep the hard copy of COE and visa at the arrival in japan as the they will ask for original COE with visa on your passport. \n\nMay I now the school names as I am also looking for the school for 1year program and how much money do I have to have in my bank? \nAnd yes, I don’t have degree but I have 6 years professional experience. \n\nThanks! "},{"comment":"do some research too man, there are a lot of schools like Nihongo Center that offers the same program and you might see a cheaper school. The reason I chose this school because my father lives near Kyoto so my accomodation will be free 😸"},{"comment":"This appears to be a post about securing a visa to legally live or work in Japan. Please consult our [visa wiki](https:\/\/www.reddit.com\/r\/movingtojapan\/wiki\/visas) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/movingtojapan) if you have any questions or concerns.*"},{"comment":"Are they actively pursuing you to get this done? Are they withholding services without evidence of the visa?\n\nThere's an old Chinese custom for dealing with difficult situations like this:\n\n1. agree to do what they say\n2. quietly not do it\n3. if someone points out that you haven't done what they say, return to Step 1.\n\nCongratulations, you're now a 老手！"},{"comment":"The school is actually trying to do this by the book and they have grounds to deny giving you classes\/board if you show up without the visa (they usually check the first day when you arrive).\n\nSo my opinion : choose either the school or keeping your old visa\n\nPS : you can ask the PSB to add an additional exit\/entry on your student visa while in China, I know several people who did that"},{"comment":"I’m confused, it isn’t exactly changing your visa if you already have certain type. You’re applying for another type that fits your visitation. And while it may cost money it’s really the proper way to enter or maintain presence in China."},{"comment":"> Any other advice?\n\nShort of going to Shenzhen and having your family cross the border to come and meet *you* at weekends and national holidays... no."},{"comment":"Do not. Do not.\n\nConsider to just delay and delay, see if they finally care or not.\n\nThese days unfortunately they may care a lot, you could look for a uni that doesn't care"},{"comment":"You can marry in the UK without her leaving the country only if she has a Tier 4 visa. In that case she can also switch to the family status (wife) also without leaving the UK."},{"comment":"Yes you can get married on a tier 4 while in the UK\nIt’s any visa that grants you leave to remain for more than 6 months \n\n"},{"comment":"This appears to be a post about securing a visa to legally live or work in Japan. Please consult our [visa wiki](https:\/\/www.reddit.com\/r\/movingtojapan\/wiki\/visas) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/movingtojapan) if you have any questions or concerns.*"},{"comment":"It's been a while so I may be misremembering, but I think this is all I needed to submit for my change of status (Student -> Professor). Any other evidence or documentation they needed was handled directly between immigration and my employer - they didn't contact me for anything extra.\n\nChange of status is generally significantly more straightforward than getting a COE \/ Visa as a non-resident, so yeah, it can seem almost *too* simple - at the time I also wondered if I was missing something major in this process."},{"comment":"Who took the documents to Immigration?  Typically if something is missing, the Immigration officer will let you know right away and either reject the application outright or give you an envelope to mail the missing documents. \n\nIf the officer accepted your application and put a notation on your gaijin card that you have an application pending, it means that you have the right documents on cursory inspection. \n\nIt’s possible that they’ll call your employer and ask for some clarifying documents when they are actually processing the application. "},{"comment":"It is correct that for category 1 and 2 companies\/organizations, the amount of supporting paperwork to submit is very little.\n\nHowever, the Immigration Bureau has the latitude to request additional documents as they wish, if they have any reason to suspect anything.\n\nThere are definitely category 1 and 2 companies, that file a lot of applications with Immigration, that will preemptively  submit additional documents that are not necessarily required, in order to avoid the application delays that come with additional document requests from Immigration. "},{"comment":"Is your name on the birth certificate? Are you legally recognized as the father?"},{"comment":"You will have to go to family court to arrange custody\/child support\/etc. "},{"comment":"Begin your paper trail early\nCall any agency you see for and get a case filed early.  Follow up with notifications of repeat offenses to build your case and to establish a pattern of behavior."},{"comment":"If you are the legal parent, then you can take your child.  You already have custody.Just make sure you got your shit together and can properly take care of the child. CPS can easily investigate you and find you an unfit parent.   But if the mom is being a bad mother then do what is best for our child, call CPS on her if you need to if she stops you from picking up your child.  If she keeps stopping you from taking your child and CPS finds her an fit parent then you will have to fight for custody by hiring a lawyer."},{"comment":"Hey, feel free to toss this advice right down the toilet if you want, but considering her actions so far, you should get a DNA test. You don't need any permission to do so, and it might save you and your daughter from future grief and\/or identity crisis.  But again, it's completely your choice. I only mention it because if you caught her cheating now, who knows what she was doing two years ago. Especially if you are your girlfriend's source of income. \n\nAs for custody, you'll definitely need a lawyer for this, buddy. Especially since your child belongs to a different country than you. There is alot of paperwork and red tape to something like this, even before considering how a court will judge it. The fact that you have evidence of unsafe acts is helpful, but not really damning. \n\nGood luck."},{"comment":"I would get a good attorney as all court systems are complicated and confusing. Also even with her current behavior because she is the mother courts tend to favor mothers in the US. Having legal counsel while expensive sets you up in a stronger position."},{"comment":"If you have to leave the US after your student visa is up, you likely can't take the child with you. Best to work on that status."},{"comment":"ISIS terrorists that are caught should have public executions"},{"comment":"I’m now at the point where I’m wondering if it wouldn’t have been such a bad thing if those attacks had gone down...\n\nInstead all we’ve got is one shoeless cocksucker in handcuffs, and he’ll probably be let go after a shithouse show trial."},{"comment":"Vox: \"I was 3, and I came with my parents, who were on student visas. They still live in New York, but we're doing the citizenship process separately. So they're not in the process right now. They're just staying residents.\n\nI was basically on an F2 visa for most of my life — that's, like, for a child or a dependent of a student.\n\n....\n\nDara Lind At some point in there, you did get a green card [for permanent residency]?\n\nSarah Jeong The system was kind of a nightmare, and it takes a lot to get a green card. I was actually in college. The day I found out that I got a green card, I think, was the same day Obama was sworn into office. So it was kind of a really meaningful day to me.\"\n\n\/\/\/\/\n\nWikipedia says that Jeong was born in 1988. Obama was inaugurated in 2009. It sounds like Jeong was on an F2 visa, as a child of a student, for 18 years, from 1991 to 2009. Presumably, her parents were on F1 student visas. F1 visas appear to be limited to the length of the academic program, and also don't allow you to work more than 20 hours per week.\n\nHow did her parents manage to stay in any combo of academic programs for 18 years, and how did they afford to stay here working only 20 hours per week? If there is more to the story, then what is it? Some type of fraud or a legitimate explanation? Maybe they had enough economic privilege that they didn't need to work?\n\nhttps:\/\/www.voxDOTcom\/policy-and-politics\/2017\/7\/5\/15905816\/immigrant-trump-citizen-patriotism"},{"comment":"Hah, other side of the wall "},{"comment":"[removed]"},{"comment":"[removed]"},{"comment":"Time to call Immigration control or ICE!"},{"comment":"She has to go back"},{"comment":"No, you can't use proof of income instead of proof of funds - the simple reason being that it's illegal to work full-time on a student visa. You can apply for permission to work 28 hours a week - this process is a formality and it's always granted, but it means that the *basic* student visa you're originally applying for doesn't let you work at all, so you can't use proof of ongoing income since that would essentially be announcing your intention to break the terms of the visa.\n\nOnce you have the work permission stamp (you can get this at the airport on the way in), you can work for an overseas employer without much hassle - just don't exceed 28 hours per week in any way that's recorded or reported. Also be aware that as a resident of Japan, your employment income will be taxable in Japan - a lot of people who are here for a year or two as a student just keep paying tax in their home country which is technically\/legally wrong but extremely unlikely to cause a problem. If you plan to be a more long-term resident then you should keep your taxes on the straight and narrow from the outset though, which means declaring your income in Japan and paying taxes here."},{"comment":"Not your own, generally, because the point of the financial statements is to show that you have enough money on hand to live and study in Japan - and proof of income doesn't prove that since you can spend all the money you make and have zero on hand when you move to Japan which is not what they want."},{"comment":"This appears to be a post about securing a visa to legally live or work in Japan. Please consult our [visa wiki](https:\/\/www.reddit.com\/r\/movingtojapan\/wiki\/visas) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/movingtojapan) if you have any questions or concerns.*"},{"comment":"You actually can use proof of income instead of bank statements. I just got approved for my student visa and can also work and only gave them proof of my mother's annual income. So to answer your first question yes it is definitely possible."},{"comment":"$10,000"},{"comment":"This appears to be a post about securing a visa to legally live or work in Japan. Please consult our [visa wiki](https:\/\/www.reddit.com\/r\/movingtojapan\/wiki\/visas) for more information.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/movingtojapan) if you have any questions or concerns.*"},{"comment":"Google or ask your consulate. "},{"comment":"She’s hot"},{"comment":"This sounds so retarded. I hope they get to sue the shit out of the FBI"},{"comment":"Russia wants to invade with everyone in America armed to the teeth. They like the challenge."},{"comment":"Wow.  A “back channel between the Kremlin and the NRA”.  Quick test for your friends and family, pedes.  If they don’t think this is the absolutely most asinine thing they have ever heard (allowances made for the young and elderly), you should disassociate."},{"comment":"This demonization of any and everything Russian has got to stop! This is complete and utter bullshit!!!! "},{"comment":"Putin promoting gun ownership in the USA to bring down America. Seems legit."},{"comment":"WTF are we becoming? "},{"comment":"If the Dems get anymore power they will put anyone with an ounce of Russian blood in camps."},{"comment":"This is getting ridiculous. When is something going to happen to all of these literal traitors in our government? Why are Brennen clapper and mueller allowed to literally make things up and act as secret police? "},{"comment":"I think She wanting an org like NRA in Russia for lobbying reasons."},{"comment":"theyre coming after the NRA here. whats next after the NRA? "},{"comment":"Just talk to someone. Maybe bar will do. Or library. Or a museum. Any place will do if you can approach someone and ask questions about a place or a piece of art. But do it unobtrusively you don't want to be a freaking creep, do you?"},{"comment":"No comrade, its not possible to have free time in Russia :("},{"comment":"I would contact CIC Canada immediately and get a straight answer. Because I think this might be an issue, since your school has some work to do for you as well "},{"comment":"M should be fine. Study permits used to be specific to the school itself, but that changed years ago. As long as you meet all the other eligibility criteria, switching schools is not the be all end all. I strongly suggest bringing supporting documentation for your current school though, as you must be able to provide a letter of acceptance and proof of funds at the time of document issuance. "},{"comment":"Yeah, fuck those foreign students knowledging up the place. Less of those please. Also less of those dastardly flemish students because you know, 'degrees will be worthless if too many people have them'. \n\nThe many (girl)friends I made who came here from abroad have enriched my understanding of europe and the world as a whole almost endlessly. I can't imagine a world in which it seems like a good idea to make it harder to study here. Fuck that shit. Just more foreigner bashing because it's cool right now. \n\nYou know what? Let's privatise universities or ban them altogether. \n\nFlemings stronk. \n\nFlemings smrat. "},{"comment":"[Click here to see the discussion on r\/belgium](\/r\/belgium\/comments\/9c31hn\/government_hardens_terms_for_recognition_of\/)"},{"comment":"Considering how many genuine students with student visas work illegal cash-in-hand jobs, I really don't think working caps and 'Mickey Mouse' courses are the issue. Enforcing the rules we already have is the problem."},{"comment":"Maybe they should label certain degrees as being eligible for work visas if it's deemed that they are shortages,and clearly say what degrees arent. We also need to encourage the locals to do the 3D jobs - dirty ,dangerous, demeaning (ok it's an old term but that's the gist of it) , and not complain that foreigners are taking up jobs which locals don't want to fill anyway. Companies to be more stringently audited to ensure they are paying people the legal wages. Foreigners are always conve I'd t scapegoats, I think we should look at what locals are doing too. "},{"comment":"I worked with Indians who were doing this. They worked like dogs and sent all the cash home. Study was just a means to gain entry to Australia. \nI worked 6 to 6 with one bloke and then dropped him at a kitchen where he worked till about 1 and started at 6 the next morning. "},{"comment":"then get rid of the courses for forgings students.. oh wait you can't.\/.. because we wouldn't have any GDP left."},{"comment":"[removed]"},{"comment":"So is there anywhere in the article where they explain what the fuck a  \"Mickey Mouse course\" actually is?"},{"comment":"I don't understand how the government expects student visa students to survive in Australia when they put a 20 hour a week cap. The courses are abysmally expensive, of course they're gonna do cash jobs to cover the courses and pay for living costs. \n\nOffering garbage courses that don't give these students an actual chance to join the Australian labour force all the while capping their earning potential is a loss for the Australian economy. If they want to work hard and contribute let them contribute, raise the 20 hr cap to 40 hrs to a standard working week, these people will only work harder and improve their English and stimulate growth in Australia.\n\nI think Labour should improve these courses so that these people can get a better life here just like the rest of us, we're all descendants from migrants after all."},{"comment":"Do you have plans to marry ? \n\nINIS have concerns about that kind of thing. That the real reason the visa is sought is not for study. \n\nI'm presuming a level 8 diploma is not a bullshit english language course ? \n\nI'd be wary of using some sort of immigration agent since there is a lot of dodgy ones. An appeal through a solicitor would be better - but not any solicitor. Again there are ones who Inis will be wary of. "},{"comment":"Suggestion: 1) contact the college for help and 2) contact your local TDs office, you’d be surprised how helpful the staff can be at times. Explain your situation to them. See if they can help."},{"comment":"Talk to the immigration officer at your local Garda station. "},{"comment":"It seems like she submitted an incorrect application? If so then the best thing to do would be to go to an Solicitor whom specializes in Immigration law, so they can help you submit an appeal "},{"comment":"Call the migrant rights centre  - they may be able to help.  Www.mrci.ie\n"},{"comment":"Dont waste money on an immigration lawyer or consultate. They will bleed you dry.\n\n If it was refused for lack of information then speak to INIS directly and give them  everything they want.  A letter from the college will help. Good luck"},{"comment":"Pester power is important in Ireland unfortunately. You need to complain to everyone that you possibly can, TDs, ministers, councillors, civil servants etc until you get the required decision. It's a pain in the hole. "},{"comment":"Best is to resubmit the documents and request them to process immediately,"},{"comment":"I can't speak to Mexican law, but in the US there would be no legal issue here. Bureaucratic slowdowns and delays are ubiquitous and you should always get a visa well (i.e. months) before you leave.  You may be able to hire a company that expedites these things to try to get your application completed\/approved for you. They are typically very expensive, especially for a turnaround this tight. You are also running into physical limitations of getting things to the embassy and back, even with overnight shipping.\n\nMy advice is to communicate with your program that you will not be on that plane, and get a different flight once your visa is processed. I would also look into one of the services I mentioned."},{"comment":"A student visa is a non-immigrant visa, meaning that the applicant is expected to return to their home country when the visa expires. As such, the government wants some kind of assurance that the applicant still has ties to their home country and intends to return to it when the visa expires. A bank account in the applicants home country with adequate funds is probably the easiest and cheapest way to meet the requirement. If your SIL doesn’t have adequate funds for that then you will need to reach out to the government or an immigration attorney and figure out an alternative means to meet the requirement."},{"comment":"http:\/\/www.alllaw.com\/articles\/nolo\/us-immigration\/applying-for-student-visa-while-on-tourist.html\n\nThis is not simple to do, is much more difficult in 2018 than it has been in the past, and if she is denied, coming back to the States will be significantly harder in the future. Do not do any of this yourselves. She needs an experienced immigration lawyer to tell her exactly how to proceed before even thinking about filing these forms."},{"comment":">Does this mean that the company does not accept international students as interns?\n\nThat's what it means."},{"comment":"You are not a US person as far as that question goes. Would this even qualify for work you could do? "},{"comment":"[https:\/\/www.seekvisa.com.au\/](https:\/\/www.seekvisa.com.au\/)"},{"comment":"[https:\/\/www.seekvisa.com.au\/study\/](https:\/\/www.seekvisa.com.au\/study\/)"},{"comment":"You are only allowed to access emergency care for free as a tourist. GP services are not covered."},{"comment":"If your post is about getting a visa (for the UK), about visas, citizenship, or residency in the UK - please visit \/r\/UKVisa or \/r\/IWantOut\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](\/message\/compose\/?to=\/r\/AskUK) if you have any questions or concerns.*"},{"comment":"Yes, fortunately I'm still legally a dependent in the states and my mother receives her insurance via her job. Otherwise I definitely would not be complaining about the IHS. Eternally grateful I haven't had to face the US healthcare system for 4 years, not particularly looking forward to returning"},{"comment":"How about contacting the consulate?"},{"comment":"Belgian red tape. Contact KUL and the consulate."},{"comment":"Anything relating to the Belgian government takes a long time. It isn't unheard of to wait 6 months for a visa. And it's August. That's like a month of basically zero work done coz everyone's off on a vacation. I'm not a student, but my husband's work permit also took forever, even with a lawyer's guidance."},{"comment":"The 'app' to track your application is only in Dutch\/French: [https:\/\/dofi.ibz.be\/sites\/dvzoe\/EN\/Application-guides\/Pages\/What\\_is\\_happening\\_to\\_my\\_visa\\_application.aspx](https:\/\/dofi.ibz.be\/sites\/dvzoe\/EN\/Application-guides\/Pages\/What_is_happening_to_my_visa_application.aspx)\n\nFirst box: Place of application\n\nSecond box: Number of your application\n\nAccording to the website of the immigration office, it should take them 3 to 6 weeks (after having received the documents) to come to a decision. I wouldn't be too stressed about things, worst case scenario the KUL will allow you to arrive a bit later too."},{"comment":"Delays in visa type D can take up to 6 months, this is the normal waiting time. Student visa is type D so you'll probably have to wait 5-6 months before getting feedback."},{"comment":"You can search for schools in NYC (or anywhere in the US) that can be attended on a F-1 or M-1 student visa [here](https:\/\/studyinthestates.dhs.gov\/school-search).  According to [this website](https:\/\/travel.state.gov\/content\/travel\/en\/us-visas\/study\/student-visa.html) it may be possible to take classes not for credit on a B-2 visa (but you'd need to make absolutely sure that the course met the criteria as taking classes for credit is not allowed on a B-2 visa)."},{"comment":"It depends on which country you are from. If you are from EU, Canada and Australia then you can just enroll in some language or culinary course and come here to chill.\n\n&#x200B;\n\nIf you are from the third world...well....forget about it."},{"comment":"If the visa hasn't been curtailed already, it will likely be cancelled by the ECO who grants your standard visit visa\n\nYou can apply for a standard visit visa, but you should fully explain your circumstances in a letter."},{"comment":"First I would double check if either visa actually allows you to volunteer at all - it is entirely possible that this would be seen as working as far as immigration are concerned."},{"comment":"Have you considered evading the authorities?"},{"comment":"My advice would be not to, travelling in the hold of the aircraft is extremely stressful for pets. \n\nFinding student accommodation that will let you have 3 cats is going to be extremely difficult in the UK. \n\nGetting them here and back is going to cost you a huge amount of money. \n\n"},{"comment":"You, can but it’s very expensive. A friend of mine transported her cats from the US and it cost close to £8k. Also, you’re unlikely to find student accommodation that allows cats - so you’ll need your own house or flat - again, very expensive. \n\n"},{"comment":"Pets are not visa dependent. Just remember that it’s going to be expensive to get them there because you cannot bring pets in the cabin on a flight into the UK. They’ll each require a microchip + rabies and a USDA vet certification within a certain amount of days before the trip. You’ll have to ship them or fly them cargo (which costs $100-$200 each).\n\nI’m bringing my cat with me when I go and it’s going cost around $300+ just for one (counting cost for vet stuff plus flying cargo)."},{"comment":"It's costing us about $500 per pet to bring our dog and cat over. This includes the flight. You also can only fly into Heathrow iirc. "},{"comment":"Just don't screw up and provide all the required documents, bank statements etc and you'll be fine, unless you're really unlucky."},{"comment":"A student F1 visa requires a non-immigrant intent. If her family (likely on H1b) has petitioned for a green card (I-140 and \/ or I-485) they have demonstrated an immigrant intent making them ineligible for all non immigrant visas (B1, F1, J1 ...). She can try for a change of status from within the US. That too is becoming difficult lately since USCIS processing time for I-539 is upto 4.5 months (135 days) and USCIS has a new rule about processing change of status that they wouldn't do it 30 days before classes start. An impossible situation to be in. https:\/\/studyinthestates.dhs.gov\/change-of-status . \n\nBut should absolutely not travel internationally - then she would need a visa stamp and consular interview to enter the US which will most likely be denied. And she would be stuck outside the country. But the present administration has made it difficult to switch to F1 within the country and have changed (for worse) the way they calculate overstay. https:\/\/www.uscis.gov\/news\/news-releases\/uscis-changing-policy-accrued-unlawful-presence-nonimmigrant-students-and-exchange-visitors \n\nAlso, from the new rules now, she will be put in deportation proceedings if any of her immigration application is denied for any reason. She will get a notice to appear (NOA) in front of an immigration judge. And while she has to stay in the US for the court appearance she also will accrue illegal stay days triggering 3 and 10 year (practically lifetime) bans. In these circumstances it would made sense to stay away from USCIS if possible. Since she is in the US, she could wait it out till the time the laws hopefully change for the better.\nhttps:\/\/qz.com\/1323136\/a-uscis-immigration-policy-change-threatens-non-citizens-with-deportation-if-they-lose-status\/\n\nI am sorry, its a mess, and despite all the Hindus for Trump, it seems deliberate, malicious and evil. Just like the way they close the legal entry points for seeking asylum and then arrest the \"illegals\".\n\nSuggestions:\n\n* Get married - apply for adjustment of status (AOS) - everything (illegal work \/ overstay) is forgiven.\n* Definitely involve a lawyer.\n* plan a backup - Canada\n\nSource: Someone who spends a lot of time on immigration boards."},{"comment":"Marry her n get her gc"},{"comment":"my sister got it yesterday. Chill"},{"comment":"I'd recommend marrying her and going the fiancé visa route. That's probably your best bet under this shitshow of an administration."},{"comment":"marry her"},{"comment":"\/r\/askspain"},{"comment":"Try google "},{"comment":"Folks, this is not a crowdfunding post.  No money is being asked for.  Please stop reporting it as such."},{"comment":"Yeah fuck BYU tbh.\n\nI played water polo in HS, and played a game or two on their campus. The fact that they made us cover up, *in the pool area*, when we were already in the most conservative, ugliest one-piece polo swimsuits you've ever seen, in *hawaii*, was my first confirmation that they were probably ass backwards. I don't understand young people that continue to join or stay with the church."},{"comment":"Thanks BYU, for contributing to Hawai'i's reputation of being an insular, self-serving community!"},{"comment":"You can also post this in r\/twoxchromosomes"},{"comment":"[“The school did not suspend the alleged attacker until after it discovered a video was recorded.”](http:\/\/www.kitv.com\/story\/38200990\/byu-hawaii-student-says-campus-security-failed-to-respond-to-violence-on-campus)\n\nThe person who recorded the video?  Yeah, that person is getting kicked out of school and out of the country."},{"comment":"It’s BYU... why would anyone be surprised? "},{"comment":"Mormon organizations have a long history of covering up anything they think might make them look bad. Physical assaults, sexual assaults, child predators, and so on.\n\nThe Boy Scouts will be better without their influence."},{"comment":"BYU is fucking rubbish"},{"comment":"Mormon church officials are treating women badly and protecting sexual predators?  Who could have possibly foreseen such a thing?  Just everybody with an ounce of intelligence."},{"comment":"I can't imagine why any woman would want to go to BYU and subject herself to that sort of discrimination and sexism"},{"comment":"This has to be quite devastating for this young girl. The Mormon community is very close knit and for her to be punished like this, I don't even want to imagine how her family back in Portugal is going to receive her when she returns home in few days. \n\nI swear I'm really nervous for her. "},{"comment":"Let me get out the way the impression that BYU-H did a lot of things wrong here regarding the investigation of the assault.  I'm not going to defend that.\n\nHowever, the issue here is whether, in response to BYU-H's improper actions or failure to act, was it appropriate for Inês Almeida to record the surveillance video and share it with the victim's family.  I say no.  \n\nSo, this is what happened:\n\n* Victim gets beaten up and event was record by security cameras\n* BYU-H fails to take action including failure to respond and failure to apparently investigate \n* Almeida *somehow* gets access to the security footage.  Perhaps she works at the security center, perhaps she knows someone, perhaps she hacked into the security severs, or perhaps she was properly invited to view the footage--I don't know. Somehow she got some documentation of that footage.  It appears she recorded a playback of the video with her phone. \n* She then sent that footage to the victim's family\n\nGranted that I don't have all the evidence, but the proper course of action seems to be that Almeida should have contacted the police."},{"comment":"So she distributed evidence from an ongoing investigation without permission and is surprised she got suspended?"},{"comment":"Just a thought, what if the video shows the girl initiating the fight.  What if the video shows that the male is actually victim, but after getting punched and kicked he finally gives in and punches back?  When the police get there both the male and female say nothing happened despite the fact that only the male has physical injuries.  What if the police begin their  investigation into the female despite the resistance of the male insisting on not pressing charges.  What if this 3rd party friend of the female decides to send the video to the female’s family who, despite seeing the female as the aggressor, feel pressure from the media and community members to do something about it and severely beat the male up... again.  What if the investigation is completely corrupted due to this 3rd party’s actions.\nJust a thought before pulling out the pitch forks."},{"comment":">Hawai'i is suspending Inês Almeida for leaking security footage that documented the assault of a female classmate.\n\nThat means she interfered with a criminal investigation, and likely could jeopardize an arrest of the entire incident.\n\n"},{"comment":"When in doubt, go to the source: [this](https:\/\/www.uscis.gov\/working-united-states\/students-and-exchange-visitors\/students-and-employment) is the USCIS page on F-1 and M-1 visa employment. Basically, the answer is \"no, you can't work on a student visa,\" at least not the kind of work you're probably thinking of, i.e. general employment at a store, restaurant, etc. There are exceptions, after your first year, but the work has to involve further training related to your program of study. CPT and OPT employment are allowed, but \n\n> For both F-1 and M-1 students any off-campus employment must be related to their area of study and must be authorized prior to starting any work by the Designated School Official (the person authorized to maintain the Student and Exchange Visitor Information System (SEVIS)) and USCIS.\n\nThis is one reason why you have to demonstrate that you have enough money to support yourself for your entire period of study. Now, this doesn't mean that people DON'T work, but it's definitely not permitted, and if caught, you might possibly lose your visa.\n\nSource: I work at a university that is almost entirely international students, and I have worked with SEVP\/SEVIS as a DSO and in planning."},{"comment":"During your first year you are only allowed to work jobs on campus (library, kitchens\/cafes, museum, cleaning, etc). Usual university rules for students working on campus: 20hrs max when taking classes, more are allowed during vacation (no classes).\n\nAfter your first year you may be given permission from immigration to work off campus."},{"comment":"You can typically work up to 20 hours a week during term and I think there is little to no restriction during non-term times. If you have an internship required by your university there are different rules. I’d talk to your international student office to make sure before you do anything. "},{"comment":"Are you from the US?  Did you at least get your passport sent back to you?"},{"comment":"By applied for visa, do you mean that you already had an appointment at the Czech embassy in your country and filed all the necessary documents?"},{"comment":"Help"},{"comment":"Up"},{"comment":" \n\nWant to grow your career in Canada? Then contact us #Akkam. We will help you throughout your journey to reach your dream country."},{"comment":"[deleted]"},{"comment":"Are you talking about the I-20?  There’s no 60 day extension that I’m aware of, but the instructions for the I-20 say you have to depart within 60 days of your program end date as listed on the I-20.  That doesn’t change your visa though."},{"comment":"AFAIK, unless they changed it recently, there is no back side to the US student visa. It's a sticker that gets put on the passport by the consulate?"},{"comment":"You'll be fine, the immigration officers don't care where you're coming from (if they even know), just that you're trying to enter the UK."},{"comment":"If I were you, I'd take a gap year and do the rest of the time you need to keep Danish citizenship.  Seems crazy to give it up."},{"comment":"Your visa isn’t really what allows you to stay in France anyway, it’s your residence permit. When you arrive you will submit some documents to OFII who should, eventually, give you a sticker in your passport called a vignette. That is what you need to remain in France and it will probably expire the day your course formally ends.\n\nYou need that vignette to stay here and you need it to enter the country. Your visa is only valid for that for the first three months."},{"comment":"Ok, so bear with me since it’s been a while since I’ve gone through the process. Student visas aren’t valid for the duration of the program, but rather for one calendar year. That means you must renew it annually. I believe you can still do it in the country. There’s more than likely many forms to fill out and I’m sure you’ll have to submit proof that you’re still enrolled in your course of study.\n\nNow, would you not be working an internship, you would not have to renew, assuming you’re coming from a country that does not require you to apply for a visa, since you can spend 3 months in the country as a tourist. All you would have to do is take a strategic trip outside of the Schengen Area and come back. \n\nUnfortunately, you’re going to be working, and that would be **highly illegal** to do without at least a student visa (it allows you to work up to 20 hours a week if I recall correctly). Not only would it be a huge liability for your employer, but it could also have you deported and barred from reentry.\n\nJust make sure that your address is correct with l’OFII, and they will send you correspondence regarding your visa status. If it’s getting to be mid July of 2019 and you haven’t heard from them, reach out to ensure your visa does not run out. "},{"comment":"I don't think you'll find many people with experience relating to your specific situation, but here are some generalities:\n\nIt's not uncommon for paperwork to go missing. Even people who apply for a US visa end up getting requests for evidence that they have previously submitted. While you may be able to prove that you submitted those documents originally, if the embassy does not currently have them then there's little you can do aside from resubmitting. You likely won't have to wait another 4 weeks (though it is possible), but I'd be surprised if they handled everything before your flight in two days.\n\nYou'll likely have to reschedule your flight and wait for the embassy to process your new documents. It sounds like your study program is handling a lot of this. They should have experience with this type of situation so try to communicate with them as much as possible in hopes that they offer guidance.\n\nLastly, I know the program bought the tickets for you but it's typically recommended to never purchase tickets or book hotel rooms before you have a visa in hand. Visa delays are very common and unless you have a refundable ticket, the likelihood of losing money in rescheduling\/cancellation fees is high."},{"comment":"You're going to struggle with that timescale.\n\nThe quickest way to get married is at the registry office, so speak to your local office and find out when they have appointments. Once you give notice, you have to tell them where you are getting married, so knowing where has space is important.\n\nOnce you give notice, the home office can have 70 days to investigate to see if it a legitimate marriage. You can only get married once you've been given clearence by the home office.\n\nThen get married! You get your marriage certificate at the ceremony. You can only sort a spouse visa after actually getting married.\n\nYou can book a priority service centre appointment to have your visa sorted in one day, but they are kinda difficult to book and will probably be 45 days away. To get you ur appointment and visa for the first 2.5 years is £1650. Then its all done for now! \n\nYou'll then have to go through an extension process at 2.5 years, then 5 years for indefinite leave to remain, all at further expense. \n\nBe careful to check that you meet all of the criteria for the FLR(M) visa, such as the minimum salary. \n\nGiven the time scale it seems very unlikely you'll get through in time to apply in country, within her visa constraints. You'll likely need to look for a different visa to cover you for that time, or relocate to china, or a 3rd party country. \n\n"},{"comment":"Do you make the miniumum income requirements?"},{"comment":"What you do you mean he \"got accepted for H1B visa\"? Do you mean the company's I-129 application was accepted and is being processed? If so, your friend is allowed to stay until October 1. All H1B visas start on October first so students who are waiting for their visas can remain in the US until that date. It is called the cap-gap extension. Go to this site and scroll down https:\/\/www.uscis.gov\/i-9-central\/complete-correct-form-i-9\/complete-section-1-employee-information-and-attestation\/foreign-academic-students#Cap-Gap\n"},{"comment":"If by \"accepted\" you mean his petition was *selected in the lottery* but not yet *approved*, [here](http:\/\/immigrationgirl.com\/opt-cap-gap-ends-september-30th-what-if-your-h-1b-petition-is-still-pending\/) is a useful link for your friend."},{"comment":"I would start by questioning why you are paying 250\/week to share with 5 other people. Sounds over priced. \n\nAs for how hard it is, that depends on the person. Some people find it really easy, some find it really hard. Objectively there is a fair amount of student work available in Sydney if you're not fussy. "},{"comment":"That’s likely about 13 hours work to pay your rent so you’d have $140 a week to live on for all of your other expenses. That’ll be interesting. \n\nYou’ll get a job no dramas. Just apply for everything."},{"comment":"You'll expect 22.50 as an entry level hospitality worker. Some retail shops will pay you less nd make you work for commission. "},{"comment":"There are too many dodgey operators that will try to underpay you. Try to get a job with a BIG company and you'll be safe. Some restaurant run by random people? Ripoff alert!"},{"comment":"With your visa on can do 20 hours on the books... But I know a lot of hospo places are happy to do some cash stuff..."},{"comment":"Hi, I applied on August 13 (no misdemeanour) and also haven't heard anything, and also start October 1, with the added fun of my current residency permit in Germany expiring on Sept 30. I also paid priority. I think they're just slow right now. Good luck!!"},{"comment":"I got mine finally on Friday of last week 😍"},{"comment":"You shall have to visit the post office you selected when you were completing your application to collect your BRP card. It will not be sent to your sponsor. Upon reception of the card you shall have to inform your sponsor."},{"comment":"This sounds like a question for the enz.org forum: \nhttps:\/\/www.enz.org\/forum\/forumdisplay.php?f=6\n\nGenerally speaking, INZ are not the best at communication and the call centre experience is very hit-or-miss. \n\nThe common-sense advice with anything immigration-related is to get advice from a Licensed Immigration Advisor (LIA), someone who is legally liable for what they tell you. Stuff you hear on the Internet can only go so far (but reading about other people’s experiences on ENZ and judging for yourself whether they are applicable is still helpful)."},{"comment":"I wouldn't risk it.   \nSince its not usual, and we have an issue with overstayers, it could void your visa and your partners by association. If you give them any reason to think you might not do things exactly by the book they can cancel your visa on the spot. If you need to sort anything out, do it from your end. Its far, far harder to do it over here and in many cases, it makes it  impossible. "},{"comment":"No one can give you immigration advice unless they are [licenced immigration advisors](http:\/\/www.iaa.govt.nz\/). It is basically against the law. [Regulations](https:\/\/www.immigration.govt.nz\/assist-migrants-and-students\/advise-migrants\/regulations-and-licensing\/regulations) and [examples of people charged](https:\/\/www.google.com\/search?q=charged+unlicensed+immigration+advice+nz&tbm=nws).\n\nBest thing is to perhaps explain to Immigration NZ what you wish to do or to the [NZ embassy\/consulate](https:\/\/www.mfat.govt.nz\/en\/embassies\/) in your country and see what they suggest. \n\nAlso other links I often share with people who ask: \n\n* [Get ready  for NZ or Planning your move to New Zealand](https:\/\/nzready.immigration.govt.nz\/).\n* https:\/\/www.newzealandnow.govt.nz\/\n* [Licenced Immigration Advisors](http:\/\/www.iaa.govt.nz\/) "},{"comment":"[deleted]"},{"comment":"I thought she could come in on a tourist visa, then activate the student visa in Feb. "},{"comment":"[deleted]"},{"comment":"Just so everyone knows, the problem she was having that was causing her not to be able to find her I-94 online was that she needed to use her middle name instead of her first name...  step 4 here https:\/\/help.cbp.gov\/app\/answers\/detail\/a_id\/1696\/~\/what-to-do-if-your-i-94-is-not-found-online"},{"comment":"Yes"},{"comment":"You have to go pre-paid. No one will do post-pay without Canadian identification\/status. "},{"comment":"[Public Mobile](https:\/\/www.publicmobile.ca) has some decent pre-paid plans and does not require a credit check or student visa, etc."},{"comment":"\n\n· We provide best training classes for IELTS\/PTE and Spoken   English with better result.\n\n· We offer best guidance to students with various options.\n\n· We do provide Visa Assistance and free counseling by our expert   Team.\n\n· Thinking for abroad hurry up to contact Right angle Global   Education.\n\n· For more information please visit our Site r\/http:\/\/rightangleeducation.com\/\n\n&#x200B;\n\nWe are Ontario\/ Canada registered Consultancy.\n\n&#x200B;\n\nStudent Visa, IELTS Training, #Student, #Visa, #IELTS, #Training\n\n&#x200B;\n\nOffice Address: 2B2 New York Corner, Opp. Rajpath Club, B\/H kiran Motors, Ahmedabad 380054.\n\n&#x200B;\n\nContact No: 7600632584, 7940029873\n\n&#x200B;\n\nEmail ID: komal@rightangleeducation.com"},{"comment":"Don't worry, your understanding was correct. As a US citizen you don't have to get an entry visa. This is stated clearly in §41 of the Aufenthaltsverordnung:\n\n>Staatsangehörige von Australien, Israel, Japan, Kanada, der Republik Korea, von Neuseeland und der Vereinigten Staaten von Amerika können auch für einen Aufenthalt, der kein Kurzaufenthalt ist, visumfrei in das Bundesgebiet einreisen und sich darin aufhalten. Ein erforderlicher Aufenthaltstitel kann im Bundesgebiet eingeholt werden.\n\nThe person in the office was probably just confused because there *is* a general requirement to get a visa before entering Germany for studies. But Americans are exempted from it by the above law. \n\nIt's not \"easier\/quicker\" to apply for a residence permit in Germany - it's *only* possible to apply for a residence permit in Germany. You can only apply for a *visa* outside of Germany, which is something different - a visa only allows you entry and 90 days to apply for a residence permit, something you already have the right to do on the basis of your citizenship. So getting a visa would be completely pointless."},{"comment":"That's what I did. Depending on where you are, it might just take a while to get an appointment. Or it could be no issue at all. I even know someone who tried to apply for a student visa (NY consulate) and they turned her away and told her to just apply for a residence permit here."},{"comment":"Bring as much documentation as possible. Your diagnosis, your lab results, etc. Bring enough hormones to last you while you estblish a GP etc. If possible have your doctor write a formal letter detailing your transition history and future plans. Ie the necessity for continued hormones with immediate effect. It appears some GPs are willing to continue and some are not. I've said I wouldn't tolerate a doctor telling me that I needed to stop taking T any more than I would any other medicine. If you've got a formal diagnosis and treatment then it should be no trouble. If your GP says no, find one that will. I've had zero problems myself but someone recently said they have had problems. Contact your uni as well as they may be able to provide guidance. "},{"comment":"What a shit uni your going to if it is in the UAE "},{"comment":"immigration is going to be an absolute hassle for you I can guarantee that "},{"comment":"Yeah you will my Qatari friend couldn't even attend her graduation here, she too had a residency permit.\n\nMake sure the University gives you a degree from their home campus and that it doesn't say (Dubai). Like Heriot Watt\/Middlesex\/Wollongong etc.\nBecause the course modules\/subjects will be the same as their home campus."},{"comment":"Youre an expat. I had quite a few expat friends from Qatar studying at Local Universities in the UAE. I doubt they faced any issue besides having to take two different flights. However I strongly advise you to contact the universities public relatioms and immigration office. Call them up and email them regularly and hopefully it should be sorted out."},{"comment":"They take your fingerprints there as part of the interview process typically. I never had to do one for Greece, but that has been the case for other visas. \n \nIts just some little thing plugged into a computer, takes like 5 minutes."},{"comment":"From my experience, it happens when you go to your visa appointment "},{"comment":">It's not clear what Zhan's status is back home.\n\nProbably “deceased.”"},{"comment":"> AR-15 \"Assault Rifle\"\n\nFucking newspeak. I forgot that the AR-15 was selective fire.  "},{"comment":"Always good to see our government actually doing their job for once."},{"comment":"Well, looks like the libtards were right. \n\nIt **is** too easy to get a gun in the US.  Just look at how quickly he received...oh wait.  That's right.  Try as he might, he could **not** purchase a weapon.\n\n**********  ONLY CONTINUE READING IF YOU'D LIKE TO HEAR HOW TOUGH IT IS TO BUY A HANDGUN IN THE USA *********\n\n\nI can't speak for the laws in 49 US states, but where I live getting a handgun requires attending a 2-3 hour safety course (my city requires that we live fire a .22 handgun at that course, not all cities do).  Ever had a DUI?  No gun for you.  Ever had a restraining order taken against you?  No gun for you.\n\nIf you're clean you may now walk into your local police station and ask to schedule an appointment to apply for a handgun LTC (License To Carry).  Whether you get the permit or not is up to the Chief of Police of the city you live in.  After you're appointment it usually takes 4-6 weeks to find out if you've been approved or not.\n\nIf you've been approved, congratulations you can now walk around strapped.  But first, you've got to purchase a gun and ammunition.  So, you go to your local gun store and ask some questions and if you decide to make a purchase another background check is run with some FBI database to make sure a restraining order wasn't issued against you that morning, or you've escaped from jail, etc.\n\nNow, if all of those steps are taken successfully, you're now the proud owner of a legal handgun in the state I live in.  During your conversation with the sales person at the gun store, if he\/she feels any reason not to sell you the gun - tough shit, they are not legally obligated to sell you shit.\n\nPurchasing non-large capacity rifles or non-large capacity shotguns is actually much easier in this state.  All you need is an FID card which is issued by your local police department and 1,000 times easier to get one as soon as you turn 18.  The FID card also allows you to purchase ammunition."},{"comment":"The whole story is fucking crazy. \n\nGood police work, good cooperation between the university administration and the feds and the local judges, and a fair bit of luck due to the fact that he left for a week for spring break which gave them time to investigate, enabled them to stop this guy before he could do any damage. \n\nHe’s China’s problem now. \n\nSpez:\n\n##### The second Chinese student in two weeks who was caught planning a mass shooting:\n\nhttp:\/\/archive.is\/VQveW"},{"comment":"great job by the store owner"},{"comment":"Universities really do hate Asians, don't they? If he were from El Salvador and  in the country illegally with no visa, i wouldn't be surprised if they paid his legal fees instead of helping to get him deported"},{"comment":"But according to the left none of us are safe because it's the gun that kills people, not the psycho Chinese man who is now arrested.."},{"comment":"Is this the second Chinese student in two weeks who was caught planning a mass shooting?\n\nEdit:  Yup.\n\nhttp:\/\/archive.is\/VQveW"},{"comment":">  he returned to Syracuse from spring break in Mexico\n\nSomething about that seems odd.\n\nThe Chinese do use that country to flood illegal, and dangerous legal, drugs into the US.  \n\nAnother idea, he wanted to see a new Great Wall and was sad when it wasn't built yet.\n\nThat is supposed to be the rule, no illegals allowed in, and if a legal alien does something unlawful or dangerous or threatening they are caught and kicked out pronto.\n\nChinese \"students\", you never know if they really are students.  A backdoor to citizenship, a backdoor to having an anchor baby, a backdoor to smuggling, there are a huge amount of Chinese \"students\" in the West who don't even go to class and if they do they don't do the work.\n\nChinese \"businessmen\", even worse.  They are often industrial spies, Chinese police, or something else than doing business."},{"comment":"This may become a problem."},{"comment":"Sleeeeeper cells.. \n"},{"comment":"China’s problem now!"},{"comment":"Wrong race to help dem agenda"},{"comment":"[deleted]"},{"comment":"[deleted]"},{"comment":"He has to go back."},{"comment":"Why did he dye his hair blonde? \nSo they could use the white male headlines?"},{"comment":"Wait, the feds helped out and justice was served...    Clearly it wasn't the FBI"},{"comment":"But I was told you only deport Mexican or radical Islam.. "},{"comment":"Does this uni academically discriminate against Asian students like some do?"},{"comment":"China doesn't take kindly to \"troubled\" returns. Defective products usually just get dumped by them."},{"comment":"How DARE they deport him!!!!! Muh OPEN Borders!!!   Muh No hu-chinese are illegal!!!!\n\nREEEEEEEEEEEEEEEEEEE!!!!!!!!!!!!!!!!!!!!!!\n\n\/s\n"},{"comment":"I’m sure Xi will have him shot for failing to sow discord and subversion in Capitalist America"},{"comment":"Holy shit I live in the Syracuse area and I heard nothing about this! Ive only heard about a planned school shooting in the jr high I used to go to and the kid arrested because students tipped the police"},{"comment":"#OUT OUT OUT "},{"comment":"This is why I have zero problems with background checks. I know that resourceful criminals will still get their hands on guns, but if one mass shooting is prevented because of it, it's worthwhile. "},{"comment":"**PIG DISGUSTING**"},{"comment":"This is all over the news in Taiwan 🇹🇼 Somehow he managed to get a pistol. They will hustle him out of the country rather than find out what was really going on. Spez:Sorry, The speculation in Taiwan news is rampant, don’t wanna spread fake news. "},{"comment":"twice they referred to AR-15 as an assault rifle, then talked about \"laser scopes\"...  It's good to know these journalists know what they're talking about.\n\n\/facepalm"},{"comment":"INB4 Moonbeam buys him a ticket back to California."},{"comment":"So when law enforcement actually does their job, they can stop a mass shooting? Imagine that."},{"comment":"Asians are *way* overrepresented in numbers as mass shooting perpetrators compared to their population proportions in the U.S. and I'm talking about Far East, Oriental Asians, not UK-style \"Asian\" from Iraq or Pakistan."},{"comment":"Wow, imagine if the police or feds had've reacted the same way to the then repeated warnings about the parkland shooter or any of the several other shooters who they ignored when warned about them."},{"comment":"diversity"},{"comment":"OUT! OUT! OUT!"},{"comment":"#OUT OUT OUT"},{"comment":"Terminate"},{"comment":"Go back to eating dog "},{"comment":"Glad they stopped him imagine what Kun-fu monstrosities this man would do "},{"comment":"Some more information: I am receiving financial aid from my home school, but I have not received any money specifically to use while studying abroad. Would this count as financial sponsorship?"},{"comment":"Since your SIL left the UK, her chances at switching to a Tier 2 visa are low. If she goes back to the UK, the Border Force Officer would likely curtail her Tier 4 visa as she is not arriving for the same general purpose for which her visa was granted.\n\nThat being said, I just read [my uni's guidance](https:\/\/www.ed.ac.uk\/global\/immigration\/at-the-end-of-your-studies\/travelling-at-end-of-studies) and the rules seems to have changed. Tier 4 visa holders apparently are now allowed to re-enter the UK if they have travelled abroad during the 'wrap up' period.\n\n>Travelling and re-entering the UK after your graduation:  \n>  \n>You should carry evidence with you to show that you intend to leave the UK before your visa expires, or that you intend to make a further immigration application (for example, a CAS or a Certificate of Sponsorship (CoS) for a Tier 2 job). \n\nSo I'd ultimately recommend your SIL discusses options with her uni. Although with a month left on the visa, her chances at finding sponsorship would quite low regardless.\n\n​"},{"comment":"Congrats! East coast winters can get really wet, expect lots of snow lol"},{"comment":"Glad you are choosing something different than Toronto or Vancouver! Hope you have fun in NS!\n\nStay outta trouble & HF!"},{"comment":"Congratulations!!! Welcome to Canada!!"},{"comment":"Congratulations on your student visa!!! And, if you don’t mind me asking out of curiosity, how difficult was the whole process to get your visa accepted? How much money did they require you to have saved for your visa to be approved? Just asking because I’m interested in moving to Canada with a student visa but won’t have anyone to help me financially like you. Is the only way I’m able to make this happen is if I’m wealthy?\nAny tips you can give me are appreciated!"},{"comment":"Congrats!"},{"comment":"Wait....You are 17, and have been accepted by a Canadian University ?. How in the hell are you able to do that ? And better still .. how are you going to pay for it ? \n\nShakes head, slowly walks away....\n\nJim B. "},{"comment":"Day after day, we’re closer to every Russian being Putin’s agent.\n\nI dare hope they’re proud of themselves."},{"comment":"Another political prisoner in a “free” country. "},{"comment":"I'm a US citizen living in Russia. At what point do I have to worry about something like this happening to me here?"},{"comment":"Hey there, \n\nI'm not from Canada but I'm from another country that has 3-months of visa free travel in France \/ The EU.\n\nI had had a similar problem as yourself and just decided to enter the country a month early, telling myself if I would just pop over to London if I really did need to re-enter to validate my visa.\n\nI spoke to some of the fellows at the immigration once I arrived in France and they laughed it off when I asked if I would need to re-enter. I've been here for about a year since then and in my nanny dealings with French immigration administration, no one has ever remarked that I entered before the start date of my visa.\n\nGood luck with your studies!"},{"comment":"You'll be perfectly fine. Don't worry."},{"comment":"> My plan right now is to go to London from Paris for a day or two in early September, and then have it stamped at St. Pancras by the French authorities upon my return.\n\nOver the years I've hired several employees \/ contractors to work in the UK or other EU \/ Schengen \/ EEA countries. They were always advised to exit and re-enter as you plan to do when their immigration status changed from tourist to worker.\n\nSo while u\/eatallthetoast is probably giving you accurate information, I personally would play it safe and take that day trip to UK and get stamped.  Your visa expiration date is probably linked to the date of entry. Your passport may still be checked as you move around - my passport was checked at a border three times on a recent trip (France - Switzerland border and Switzerland - Italy border on an overnight train, Italy - France border on a daytime train). I was also asked to show my passport once checking into a hotel.\n\nImmigration status is not something to take lightly, and encountering a stricter border agent (or one just having a bad day) is not a risk I would take. \n"},{"comment":"If you already booked your flight why don't you just spend the day in the airport before going to immigration? It may sound silly but changing flights is expensive."}]